{
	"_meta": {
		"sources": [
			{
				"json": "HalastersChallenge",
				"abbreviation": "HC",
				"full": "Halaster's Challenge",
				"url": "",
				"authors": [
					"Zuishin"
				],
				"convertedBy": []
			}
		],
		"dateAdded": 1590186165,
		"dateLastModified": 1590186165
	},
	"monster": [
		{
			"name": "L1: Halaster's Nilbog",
			"shortName": "Nilbog",
			"source": "HalastersChallenge",
			"size": "S",
			"type": {
				"type": "humanoid",
				"tags": [
					"goblinoid"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				15
			],
			"hp": {
				"formula": "14d6 + 28",
				"average": 77
			},
			"speed": {
				"walk": 40
			},
			"str": 8,
			"dex": 20,
			"con": 14,
			"int": 10,
			"wis": 8,
			"cha": 23,
			"save": {
				"cha": "+11",
				"dex": "+10",
				"con": "+7"
			},
			"skill": {
				"stealth": "+15",
				"acrobatics": "+10"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 9,
			"conditionImmune": [
				"charmed",
				"poisoned"
			],
			"languages": [
				"Common",
				"Goblin",
				"Infernal",
				"Undercommon"
			],
			"cr": "14",
			"spellcasting": [
				{
					"name": "Innate Spellcasting",
					"headerEntries": [
						"The nilbog's innate spellcasting ability is Charisma (spell save {@dc 19}). It can innately cast the following spells, requiring no material components:"
					],
					"will": [
						"{@spell dissonant whispers|PHB}",
						"{@spell feather fall|PHB}",
						"{@spell mage hand}",
						"{@spell reverse gravity|PHB} (self only)",
						"{@spell vicious mockery}"
					],
					"daily": {
						"1e": [
							"{@spell feeblemind|PHB}",
							"{@spell synaptic static|XGE}"
						],
						"3e": [
							"{@spell confusion}",
							"{@spell counterspell|PHB}",
							"{@spell dimension door|PHB} (self only)",
							"{@spell fly|PHB} (self only)",
							"{@spell greater invisibility|PHB}",
							"{@spell hypnotic pattern|PHB}",
							"{@spell misty step|PHB}"
						]
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Nilbogism",
					"entries": [
						"Any creature that attempts to damage the nilbog must first succeed on a {@dc 15} Charisma saving throw or be {@condition charmed} until the end of the creature's next turn. A creature {@condition charmed} in this way must use its action praising the nilbog. The nilbog can't regain hit points, including through magical healing, except through its Reversal of Fortune reaction.",
						"Additionally, if the Nilbog is magically healed through means outside of its Reversal of Fortune reaction then it takes damage equal to four times the amount healed."
					]
				},
				{
					"name": "Tumble",
					"entries": [
						"The nilbog can tumble as a bonus action, imposing the following effects for the rest of its turn:",
						"It gains a the benefits of Dash and Disengage actions. ",
						"It gains a climbing speed equal to its current speed.",
						"It takes half damage from falling."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the nilbog fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Lucky",
					"entries": [
						"The nilbog has 3 luck points. Whenever it makes an attack roll, ability check, or saving throw, it can spend one luck point to roll an additional {@dice d20} (this can occur after seeing the roll, but before the outcome is determined). ",
						"The nilbog can also spend one luck point to when an attack is made against it. Roll a {@dice d20} and it can choose which roll is used."
					]
				},
				{
					"name": "Nimble Escape",
					"entries": [
						"The nilbog can take the {@action Disengage} or {@action Hide} action as a bonus action on each of its turns."
					]
				}
			],
			"action": [
				{
					"name": "Invoke Duplicity (1/Day)",
					"entries": [
						"The nilbog creates four perfect illusions of itself that last 1 minute. The illusions appear in unoccupied spaces that it can see within 30 feet. As a bonus action the nilbog can move any number of the duplicates 40 feet, to a max range of 120 feet.",
						"The nilbog can cast from the duplicate's space, and if a duplicate and the nilbog are within 5 feet of the same creature, it gains advantage on any attack rolls against the creature."
					]
				},
				{
					"name": "Fool's Scepter",
					"entries": [
						"{@atk mw} {@hit 10} to hit, reach 5 ft., one target. {@h}8 ({@damage 1d6 + 5}) bludgeoning damage, plus 27 ({@damage 8d6}) psychic damage."
					]
				}
			],
			"reaction": [
				{
					"name": "Reversal of Fortune",
					"entries": [
						"In response to another creature dealing damage to the nilbog, the nilbog reduces the damage to 0 and regains {@dice 4d6} hit points."
					]
				},
				{
					"name": "Spell Reflection",
					"entries": [
						"If the nilbog makes a successful saving throw against a spell, or a spell attack misses it, the nilbog can choose another creature (including the spellcaster) it can see within 60 feet of it. The spell targets the chosen creature instead of the nilbog. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
					]
				}
			],
			"legendaryActions": 3,
			"legendary": [
				{
					"name": "Fool's Scepter",
					"entries": [
						"The nilbog makes an attack with his Fool's Scepter."
					]
				},
				{
					"name": "Illusory Swap",
					"entries": [
						"The nilbog swaps places with one of his illusory duplicates, if any are available. It need not hear or see the duplicate. He can also swap places with a creature that is affected by the {@spell seeming} spell caused by his lair action."
					]
				},
				{
					"name": "Cast a Spell (Costs 2 actions)",
					"entries": [
						"The nilbog casts one of his at will spells."
					]
				},
				{
					"name": "Teleport (Costs 3 actions)",
					"entries": [
						"The nilbog magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
					]
				},
				{
					"name": "Lair actions (on init 20)",
					"entries": [
						"On Initiative count 20 (losing initiative ties), the nilbog can take a lair action to cause one of the following effects: it can't use the same effect two rounds in a row:",
						"-Fog magically fills the lair, the fog (can't be dissipated by wind) causes the lair to be heavily obscured for 1 round.",
						"-Every creature in the lair assumes the form of the nilbog for 1 round. The changes fail to hold up to physical inspection, as if affected by the {@spell seeming} spell. Damaging a creature also removes the form.",
						"-The nilbog's laugh can be heard throughout the entirety of the lair, all creatures in the lair that can hear must make a {@dc 15} Wisdom saving throw or they can't dash or disengage for 1 round."
					]
				}
			],
			"environment": [
				"forest",
				"hill",
				"underdark"
			],
			"fluff": {
				"name": "Nilbog",
				"source": "VGM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											"When Maglubiyet conquered the goblin gods, he intended to leave only Khurgorbaeyag alive as a harsh overseer who would keep the goblins under heel. But the goblins' pantheon included a trickster deity who was determined to get the last laugh. Although its essence was shattered by Maglubiyet, this trickster god survives in splintered form as a possessing spirit that arises when goblinoids form a host, causing disorder in the ranks unless it is appeased. Goblins have no name for this deity and dare not give it one, lest Maglubiyet use its name to ensnare and crush it as he did their other deities. They call the possessing spirit, and the goblin possessed by it, a nilbog (\"goblin\" spelled backward), and they revel in the fear that a nilbog sows among the ranks of the bugbears and hobgoblins in the host.",
											{
												"name": "Goblins' Revenge",
												"entries": [
													" When goblinoids form a host, there is a chance that a goblin will become possessed by a nilbog, particularly if the goblin has been mistreated by its betters. This possession turns the goblin into a wisecracking, impish creature fearless of reprisal. It gives the goblin strange powers that drive others to do the opposite of what they desire. Attacking a goblin possessed by a nilbog is foolhardy, and killing the creature just prompts the spirit to possess another goblin. The only way to keep a nilbog from wreaking havoc is to treat it well and give it respect and praise."
												],
												"type": "entries"
											},
											{
												"name": "No Joking Matter",
												"entries": [
													" The possible presence of a nilbog in a host has given rise to a practice among goblinoids that each host include at least one goblin jester. This jester is allowed to go anywhere and do whatever it pleases. The position of jester is a much sought-after one among the goblins, because even if the jester is obviously not a nilbog, hobgoblins and bugbears indulge its manic behavior."
												],
												"type": "entries"
											}
										]
									},
									{
										"type": "entries",
										"name": "Nilbogism",
										"entries": [
											"A nilbog is an invisible spirit that possesses only goblins. Bereft of a host, the spirit has a flying speed of 30 feet and can't speak or be attacked. The only action it can take is to attempt to possess a goblin within 5 feet of it.",
											"A goblin targeted by the spirit must succeed on a DC 15 Charisma saving throw or become possessed. While possessed by the spirit, the goblin's alignment becomes chaotic evil, its Charisma becomes 15 (unless it was already higher), and it gains the nilbog's Innate Spellcasting and Nilbogism traits, as well as its Reversal of Fortune reaction. If the save succeeds, the spirit can't possess that goblin for 24 hours. If its host is killed or the possession is ended by a spell such as hallow, magic circle, or protection from evil and good, the spirit searches for another goblin to possess. The spirit can leave its host at any time, but it won't do so willingly unless it knows there's another potential host nearby. A goblin stripped of its nilbog spirit reverts to its normal statistics and loses the traits it gained while possessed."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/VGM/Nilbog.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/VGM/Nilbog.png?v=1.102.7",
			"soundClip": "https://media-waterdeep.cursecdn.com/file-attachments/0/359/nilbog.mp3",
			"traitTags": [
				"Legendary Resistances"
			],
			"senseTags": [
				"SD"
			],
			"languageTags": [
				"C",
				"GO",
				"I",
				"U"
			],
			"damageTags": [
				"B",
				"Y"
			],
			"spellcastingTags": [
				"I"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"charmed"
			],
			"conditionInflictSpell": [
				"incapacitated",
				"prone"
			],
			"uniqueId": "83eea1b0ac7c5688b391e2802c8a9b5f"
		},
		{
			"name": "L1: Halaster's Nilbog Prime",
			"shortName": "Carrion Crawler",
			"source": "HalastersChallenge",
			"size": "G",
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 16,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "13d20 + 78",
				"average": 214
			},
			"speed": {
				"walk": 30,
				"climb": 30
			},
			"str": 19,
			"dex": 13,
			"con": 23,
			"int": 4,
			"wis": 10,
			"cha": 6,
			"skill": {
				"perception": "+4",
				"athletics": "+8"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 14,
			"immune": [
				"acid",
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"poisoned"
			],
			"cr": "12",
			"trait": [
				{
					"name": "Keen Smell",
					"entries": [
						"The carrion crawler has advantage on Wisdom ({@skill Perception}) checks that rely on smell."
					]
				},
				{
					"name": "Spider Climb",
					"entries": [
						"The carrion crawler can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
					]
				},
				{
					"name": "Bloodied",
					"entries": [
						"When the carrion crawler is first reduced to below half its maximum hit points, its tentacle flurry action recharges and it can immediately use it."
					]
				},
				{
					"name": "Reactive Tentacles",
					"entries": [
						"For each tentacle the carrier crawler has beyond one, it gets an extra reaction that can be used only for opportunity attacks with its tentacles."
					]
				},
				{
					"name": "Siege Monster",
					"entries": [
						"The carrion crawler deals double damage to objects and structures."
					]
				},
				{
					"name": "Tentacle Maneuverability",
					"entries": [
						"As a bonus action, the carrion crawler can move any number of creatures that are {@condition grappled} by its tentacles up to 15 feet straight towards it or away from it. This movement can not exceed the tentacle's reach."
					]
				},
				{
					"name": "Tentacles",
					"entries": [
						"The carrion crawler has eight tentacles. Whenever the carrion crawler takes 30 or more damage in a single turn, one of its tentacles are severed."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The carrion crawler makes a bite attack and up to four tentacle attacks, or it makes up to eight tentacle attacks. The number of tentacle attacks the carrion crawler makes in a turn can not exceed the number of tentacles it has."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 10 ft., one target. {@h}16 ({@damage 2d10 + 4}) piercing damage."
					]
				},
				{
					"name": "Tentacles",
					"entries": [
						"{@atk mw} {@hit 2} to hit, reach 20 ft., one target. {@h}7 ({@damage 1d4 + 4}) bludgeoning damage, and the target must succeed on a {@dc 15} Constitution saving throw or be {@condition poisoned} for 1 minute. Until this poison ends, the target is {@condition paralyzed}. The target can repeat the saving throw at the end of each of its turns, ending the poison on itself on a success.",
						"Additionally, if 2 of the tentacles hit the same creature in one turn, that creature is {@condition grappled} (escape {@dc 15}). Until this grapple ends, the target is {@condition restrained}, and the carrion crawler can't use this tentacle against other targets."
					]
				},
				{
					"name": "Swallow",
					"entries": [
						"The carrion crawler makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target takes the bite's damage, the target is swallowed, and the grapple ends. While swallowed, the creature is {@condition blinded} and {@condition restrained}, it has total cover against attacks and other effects outside the carrion crawler, and it takes 17 ({@damage 5d6}) acid damage at the start of each of the carrion crawler's turns.",
						"If the carrion crawler takes 20 damage or more on a single turn from the creatures inside it, the carrion crawler must succeed on a {@dc 21} Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall {@condition prone} in a space within 10 feet of the carrion crawler. If the carrion crawler dies, a swallowed creature is no longer {@condition restrained} by it and can escape from the corpse by using 30 feet of movement, exiting {@condition prone}."
					]
				},
				{
					"name": "Tentacle Flurry {@recharge}",
					"entries": [
						"The carrion crawler wildly flails its tentacles in a 15-foot cone. Each creature in that area must make a {@dc 15} Dexterity saving throw, taking 27 ({@damage 6d8}) bludgeoning damage on a failed save, or half as much on a successful one. Additionally, a failure requires the creature to succeed on a {@dc 15} Constitution saving throw or be {@condition poisoned} for 1 minute. Until this poison ends, the target is {@condition paralyzed}. The target can repeat the saving throw at the end of each of its turns, ending the poison on itself on a success."
					]
				}
			],
			"legendary": [
				{
					"name": "Bite/Swallow",
					"entries": [
						"The carrion crawler makes one bite attack or take the swallow action."
					]
				},
				{
					"name": "Detect",
					"entries": [
						"The carrion crawler makes a perception check."
					]
				},
				{
					"name": "Tentacle Flurry (Costs 2 actions)",
					"entries": [
						"The carrion crawler takes the tentacle flurry action, provided it is recharged."
					]
				}
			],
			"environment": [
				"underdark"
			],
			"fluff": {
				"name": "Carrion Crawler",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Carrion crawlers scour putrid flesh from carcasses and gobble the slimy bones that remain. They aggressively attack any creature that trespasses on their territory or disturbs their feasting.",
									{
										"name": "Carrion Eaters",
										"type": "entries",
										"entries": [
											"A carrion crawler follows the scent of death to its food, but it prefers not to compete with other scavengers. These foul creatures thus hunker down in territories where death is plentiful and other carrion eaters have limited mobility. Caves, sewers, dungeons, and forested marshes are their favored lairs, but carrion crawlers are also drawn to battlefields and cemeteries. A carrion crawler roams on the hunt, its tentacles probing the air for the scent of blood or decay. In tunnels or ruins, carrion crawlers scurry across the ceiling as they move toward food. In this way, they avoid contact with oozes, otyughs, and other dangerous inhabitants of the darkness, even as they surprise potential meals that don't think to look up."
										]
									},
									{
										"name": "Patient Predators",
										"type": "entries",
										"entries": [
											"Whether in subterranean darkness or while hunting at night, light signals a potential meal. A carrion crawler might follow a light source from a distance for hours, hoping to pick up the scent of blood. Despite their great size, carrion crawlers can also easily set up ambushes by waiting around blind corners for prey to come to them. When facing potential prey or intruders, a carrion crawler lets its poison do the work. Once a victim goes rigid with paralysis, the carrion crawler wraps it with its tentacles and drags it away to a high ledge or isolated passageway, where it can be killed safely. The monster then resumes patrolling its territory while waiting for its meal to ripen."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Carrion Crawler.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Carrion Crawler.png?v=1.102.7",
			"soundClip": "https://media-waterdeep.cursecdn.com/file-attachments/0/79/carrior-crawler.mp3",
			"traitTags": [
				"Keen Senses",
				"Siege Monster",
				"Spider Climb"
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack",
				"Swallow",
				"Tentacles"
			],
			"damageTags": [
				"A",
				"B",
				"P"
			],
			"miscTags": [
				"AOE",
				"MW",
				"RCH"
			],
			"conditionInflict": [
				"blinded",
				"grappled",
				"paralyzed",
				"poisoned",
				"restrained"
			],
			"uniqueId": "a622c299a7e85f0227600550744fc284"
		},
		{
			"name": "L2: Halaster's Nothic",
			"shortName": "Nothic",
			"source": "HalastersChallenge",
			"size": "L",
			"type": "aberration",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 17,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "36d10 + 180",
				"average": 378
			},
			"speed": {
				"walk": 40
			},
			"str": 18,
			"dex": 20,
			"con": 20,
			"int": 17,
			"wis": 12,
			"cha": 12,
			"save": {
				"wis": "+5"
			},
			"skill": {
				"insight": "+9",
				"acrobatics": "+9",
				"perception": "+9"
			},
			"senses": [
				"truesight 120 ft."
			],
			"passive": 19,
			"resist": [
				{
					"resist": [
						"necrotic"
					]
				},
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks"
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"blinded",
				"charmed",
				"frightened",
				"poisoned"
			],
			"languages": [
				"Deep Speech",
				"Undercommon",
				"telepathy"
			],
			"cr": "12",
			"trait": [
				{
					"name": "Keen Sight",
					"entries": [
						"The nothic has advantage on Wisdom ({@skill Perception}) checks that rely on sight."
					]
				},
				{
					"name": "Viral Vision",
					"entries": [
						"Any creature {@condition poisoned} by the nothic's Necrotic Eye acts as a conduit for the nothic's sight, allowing the nothic to see from the creature's position, unless that creature is {@condition blinded}.",
						"As a bonus action, the nothic can channel his necrotic gaze through an infected creature, all creatures of the nothic's choice within 10 feet of such a creature must make a {@dc 17} Constitution saving throw or take 21 ({@damage 6d6}) necrotic damage. As part of this action, the nothic can move the creature target up to 10 feet in any direction."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the nothic fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Phases",
					"entries": [
						"The nothic has a second phase (Frenzy) that is entered once it is bloodied (189 avg, 270 max). "
					]
				},
				{
					"name": "Aberrant Ground (Frenzy Only)",
					"entries": [
						"The ground in a 10-foot radius around the nothic is doughlike difficult terrain. Each creature that starts its turn in that area must succeed on a {@dc 12} Strength saving throw or have its speed reduced to 0 until the start of its next turn."
					]
				},
				{
					"name": "Evasion (Frenzy only)",
					"entries": [
						"If the nothic is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the nothic instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
					]
				}
			],
			"action": [
				{
					"name": "Mobile Claw (Frenzy Only)",
					"entries": [
						"The nothic moves up to half its movement towards a creature and makes a claw attack. If the attack hits, the target is subject to the damage and poison described by the claw attack and must succeed a {@dc 17} Strength saving throw or be knocked {@condition prone}. Pass or fail, the target is {@condition grappled}. This movement does not provoke attacks of opportunity."
					]
				},
				{
					"name": "Multiattack",
					"entries": [
						"The nothic makes up to three claw attacks, or one claw attack and one other action listed below. If the nothic is in its frenzy phase it can make up to four claw attacks instead of three."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h} 18 ({@damage 4d6 + 4}) slashing damage. The creature is also subject to the poison described by the Necrotic Eye action."
					]
				},
				{
					"name": "Necrotic Eye",
					"entries": [
						"The nothic forces each creature of its choice in a 30-foot cone to succeed a {@dc 17} Constitution saving throw or be {@condition poisoned}. While {@condition poisoned} this way, a creature takes 20 ({@damage 8d4}) necrotic damage at the start of each of their turns. The saving throw can be repeated at the end of each of the creature's turns. A creature who has already succeeded a save against this poison this turn automatically succeeds on any further instances for the remainer of this turn."
					]
				},
				{
					"name": "Eye of Insanity {@recharge 3}",
					"entries": [
						"The nothic targets a creature within 30 feet that it can see. The creature must succeed on a {@dc 17} Wisdom saving throw or be afflicted with short-term madness (roll on the {@table short-term madness} table). The creature can repeat the saving throw at the end of each of its turns, ending the effect on a success. The nothic automatically knows in what way the target creature is afflicted."
					]
				},
				{
					"name": "Mesmerizing Visage {@recharge 5}",
					"entries": [
						"The nothic chooses a point within 120 feet of it that it can see. Each creature in a 10-foot-radius sphere centered on that point must make a {@dc 17} Wisdom saving throw, taking 44 ({@damage 8d10}) psychic damage on a failure, and half as much on a success. Additionally, a creature that fails has disadvantage on Wisdom saving throws for 1 minute. An effected creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
					]
				}
			],
			"reaction": [
				{
					"name": "Ineffable Flash",
					"entries": [
						"As a reaction when a creature the nothic can see damages it, the nothic releases a flash from its eye. Any creature within 5 feet of the nothic that can see it must succeed a {@dc 17} Constitution saving throw or be {@condition blinded} until the end of the nothic's next turn."
					]
				}
			],
			"legendary": [
				{
					"name": "Claw",
					"entries": [
						"The nothic makes a claw attack."
					]
				},
				{
					"name": "Detect",
					"entries": [
						"The nothic makes a Wisdom (perception) check."
					]
				},
				{
					"name": "Move",
					"entries": [
						"The nothic moves up to its speed without provoking opportunity attacks."
					]
				},
				{
					"name": "Whirlwind (Costs 2 Actions)",
					"entries": [
						"The nothic makes a claw attack at each creature within 5 feet of it."
					]
				},
				{
					"name": "Viral Vision (Costs 2 Actions)",
					"entries": [
						"The nothic uses the bonus action described by its Viral Vision trait."
					]
				},
				{
					"name": "Draining Visage (Frenzy only, Costs 2 Actions)",
					"entries": [
						"The nothic targets a creature that it can see and it has {@condition grappled}. The target must succeed on a {@dc 17} Constitution saving throw or take 33 ({@damage 6d10}) necrotic damage and have its Strength score reduced by {@dice 1d8}. The target dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a long rest. The nothic regains hit points equal to the amount of necrotic damage dealt."
					]
				},
				{
					"name": "Lair Actions",
					"entries": [
						"On initiative count 20 (losing initiative ties), the nothic can take a lair action to cause one of the following effects; it can't use the same effect two rounds in a row:",
						"• The nothic casts {@spell dispel magic|phb} (no components required) on any number of creatures it can see within 120 feet of it. Use intelligence as spellcasting. For each success, the nothic restores {@dice 1d8} hit points per level of spells dispelled.",
						"• The nothic taps into the eyesight of creatures in its lair and alters their perception. Each creature of the nothic's choice in the lair must make a {@dc 17} Wisdom saving throw. On a failure, the affected creature perceives objects and creatures a short distance from their actual locations, imposing disadvantage on the creature's attack rolls against those targets. An affected creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to this lair action for the next 24 hours.",
						"• Smooth surfaces within the lair become as reflective as a polished mirror. Until a different lair action is used, creatures within the lair have disadvantage on Dexterity (Stealth) checks made to hide."
					]
				}
			],
			"environment": [
				"underdark"
			],
			"fluff": {
				"name": "Nothic",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"A baleful eye peers out from the darkness, its gleam hinting at a weird intelligence and unnerving malevolence. Most times, a nothic is content to watch, weighing and assessing the creatures it encounters. When driven to violence, it uses its horrific gaze to rot the flesh from its enemies' bones.",
									{
										"name": "Cursed Arcanists",
										"type": "entries",
										"entries": [
											"Rather than gaining the godlike supremacy they crave, some wizards who devote their lives to unearthing arcane secrets are reduced to creeping, tormented monsters by a dark curse left behind by Vecna, a powerful lich who, in some worlds, has transcended his undead existence to become a god of secrets. Nothics retain no awareness of their former selves, skulking amid the shadows and haunting places rich in magical knowledge, drawn by memories and impulses they can't quite understand."
										]
									},
									{
										"name": "Dark Oracles",
										"type": "entries",
										"entries": [
											"Nothics possess a strange magical insight that allows them to extract knowledge from other creatures. This grants them unique understanding of secret and forbidden lore, which they share for a price. A nothic covets magic items, greedily accepting such gifts from creatures that seek out its knowledge.",
											{
												"name": "Lurkers in Magical Places",
												"entries": [
													" Nothics are notorious for infiltrating arcane academies and other places rich in magical learning. They are driven by the vague knowledge that there exists a method to reverse their condition. This isn't a clear sense of purpose, but rather an obsessive tug at the end of the mind. Some nothics are clever enough to realize that this is merely part of the strange lesson for their folly, a false hope to drive them to seek out more arcane secrets."
												],
												"type": "entries"
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Nothic.png"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Nothic.png?v=1.103.2",
			"soundClip": "https://media-waterdeep.cursecdn.com/file-attachments/0/361/nothic.mp3",
			"traitTags": [
				"Keen Senses",
				"Legendary Resistances"
			],
			"senseTags": [
				"U"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"DS",
				"TP",
				"U"
			],
			"damageTags": [
				"N",
				"S",
				"Y"
			],
			"miscTags": [
				"AOE",
				"MW"
			],
			"conditionInflict": [
				"blinded",
				"grappled",
				"poisoned",
				"prone"
			],
			"uniqueId": "0ddc1ffa428ae65b8646ffddb74df555"
		}
	]
}