{
	"siteVersion": "1.137.1",
	"_meta": {
		"sources": [
			{
				"json": "ZCC",
				"abbreviation": "ZCC",
				"full": "Zuishin's Creature Collection",
				"color": "ddc07b",
				"authors": [
					"Zuishin"
				],
				"convertedBy": [],
				"version": "1.0",
				"url": "https://github.com/ZuishinGit/ZuishinHomebrew/tree/master",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1633294774,
		"dateLastModified": 1633294774
	},
	"legendaryGroup": [
		{
			"name": "Acantha",
			"source": "ZCC",
			"lairActions": [
				"When fighting inside her grove of horrors, Acantha can invoke the ambient magic to take lair actions. On initiative count 20 (losing initiative ties), Acantha takes a lair action to cause one of the following effects:",
				{
					"type": "list",
					"items": [
						"Acantha casts the {@spell entangle} spell. While maintaining concentration on this effect, Acantha can't take other lair actions.",
						"Acantha summons {@dice 1d4+1} {@creature blight minion|zcc|blight minions} in unoccupied spaces that she can see within 120 feet of her.",
						"Poisonous spores fill a 10-foot cube that Acantha can see within 120 feet of her. Any creature that enters the cloud for the first time on a turn or starts its turn there must succeed on a {@dc 19} Constitution saving throw or be {@condition poisoned} until the end of its next turn. The cloud lasts for 1 minute or until it is dispersed by a strong wind."
					]
				}
			]
		},
		{
			"name": "King Snurre",
			"source": "ZCC",
			"lairActions": [
				"A {@creature hell hound} that King Snurre can see immediately recharge and uses their fire breath.",
				"{@dice 1d4} 10-foot-square pools of lava begin to rise from the floor in areas that King Snurre can see, and remain there for 1 minute. A creature that starts its turn in the pool of lava must succeed a {@dc 15} Dexterity saving throw or take 22 ({@damage 4d10}) fire damage.",
				"King Snurre casts {@spell immolation|xge} (no components required; Save {@dc 15}) on a creature he can see within 90 feet. While he maintains concentration on this effect, King Snurre can't take other lair actions."
			]
		}
	]
}