{
	"_meta":{
		"sources":[
			{
				"json":"EM5E",
				"abbreviation":"EM5E",
				"full":"Encyclopedia Magica for 5e",
				"authors":[
					"Zuishin"
				],
				"convertedBy":[
					"Zuishin"
				],
				"version":"1.0",
				"url":"https://github.com/ZuishinGit/ZuishinHomebrew/tree/master",
				"targetSchema":"1.0.0"
			}
		]
	},
	"table":[
		{
			"name":"Random Artifact Powers: Abjuration",
			"source":"EM5E",
			"caption": "Abjuring Effects of Artifacts",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cast {@spell banishment} (1/Week)"
				],
				[
					"2",
					"Cast {@spell antilife shell}, affecting one of the following creature types: aberrations, celestials, elementals, fey, fiends, or undead (1/Day)"
				],
				[
					"3",
					"Cast {@spell banishment} with range: touch (1/Day)"
				],
				[
					"4",
					"Instantly dismiss an elemental (1/Week)"
				],
				[
					"5",
					"Cast {@spell planar binding} (1/Week)"
				],
				[
					"6",
					"Cast {@spell dispel evil and good} (1/Day)"
				],
				[
					"7",
					"Cast {@spell dispel magic} (1/Day)"
				],
				[
					"8",
					"Cast {@spell holy aura} (1/Week)"
				],
				[
					"9",
					"Cast {@spell banishment}, sending a creature to a plane of the DM's choice (1/Week)"
				],
				[
					"10",
					"Cast {@spell imprisonment} (1/Month)"
				],
				[
					"11",
					"Cast {@spell knock} (3/Day)"
				],
				[
					"12",
					"Cast {@spell primordial ward} (1/Day)"
				],
				[
					"13",
					"Gain the following trait while holding the artifact: When you make a successful saving throw against a spell of 2nd level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"14",
					"Cast {@spell purify food and drink} (At will)"
				],
				[
					"15",
					"Cast {@spell remove curse} (3/Day)"
				],
				[
					"16",
					"Constantly repel all insects within 10 feet of the artifact"
				],
				[
					"17",
					"Cast {@spell magic circle} (1/Week)"
				],
				[
					"18",
					"Gain the following trait while holding the artifact: Once per day, when you make a successful saving throw against a spell of 7th level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"19",
					"Dispel illusions within a 60-foot radius (3/Day)"
				],
				[
					"20",
					"Have the {@spell resistance} spell continually in effect while the artifact is in hand"
				]
			]
		},
		{
			"name":"Random Artifact Powers: Cataclysm",
			"caption":"Cataclysmic Effects of Artifacts",
			"source":"EM5E",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cause acid rain to fall (see the second round effect of the {@storm of vengeance} spell)"
				],
				[
					"2",
					"Create a permanent aura of {@hazard desecrated ground}, in which plants twist and wither, crops fail, and herds grow sickly"
				],
				[
					"3",
					"Blanket the area in a {@hazard blizzard} that lasts {@dice 1d6 + 12} hours"
				],
				[
					"4",
					"Create a storm of lightning that lasts 3 days, with lightning striking every 10 minutes per the {@spell call lightning} spell"
				],
				[
					"5",
					"Create an immobile {@spell cloudkill} spell for {@dice 1d6} hours"
				],
				[
					"6",
					"Form a ring of creeping doom in the area, taking 4 hours to reach the center. Until then, the area is infested with hazardous dark tendrils, per the {@spell arms of hadar} spell"
				],
				[
					"7",
					"Settle a fog of death over the area, which is fatal to creatures that stay in it for more than a day. The fog lasts {@dice 2d20} hours"
				],
				[
					"8",
					"Cause a permanent drought in the area"
				],
				[
					"9",
					"Cause an earthquake centered on the artifact, per the {@spell earthquake} spell"
				],
				[
					"10",
					"Call down a series of {@1d6} {@spell sunburst||sunbursts} within the area"
				],
				[
					"11",
					"Flood the area, per the {@spell tsunami} spell"
				],
				[
					"12",
					"Sweep an incendiary cloud through the entire area"
				],
				[
					"13",
					"Settle a plague of insects upon the area for {@dice 1d6} hours"
				],
				[
					"14",
					"Instantly create a permanent {@spell antimagic field} over the area"
				],
				[
					"15",
					"Call down a {@spell meteor swarm} that lasts for {@dice 1d12} hours (480 meteors per hour), randomly striking targets within the area"
				],
				[
					"16",
					"Create a permanent area which drains one point of a creature's Strength score for every 24 hours they spend in the area. A creature dies if this reduces its Strength to 0. The reduction lasts until the creature finishes a short or long rest outside of the area"
				],
				[
					"17",
					"Create a permanent wild magic zone (roll on the {@table Wild Magic Surge} table in the Player's Handbook whenever a spell is cast within the zone)"
				],
				[
					"18",
					"Transfer the whole area to a randomly chosen plane. The artifact is not transported"
				],
				[
					"19",
					"Strike the entire area with a {@spell storm of vengeance}"
				],
				[
					"20",
					"Create permanent wolf spirits to guard the area of effect, which are hostile to all creatures except beasts, plants, and constructs"
				]
			]
		},
		{
			"name":"Random Enhancements",
			"caption":"Magic items and their enhancements",
			"source":"EM5E",
			"colLabels":[
				"d100",
				"Enhancement Type"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1-10",
					"{@item anything item|EM5E|anything}"
				],
				[
					"11-20",
					"{@item aquatic equipment|EM5E|aquatic}"
				],
				[
					"21-30",
					"{@item cloaked wizardry|EM5E|cloaked}"
				],
				[
					"31-40",
					"{@item lightweight equipment|EM5E|lightweight}"
				],
				[
					"41-50",
					"{@item miniature equipment|EM5E|miniature}"
				],
				[
					"51-60",
					"{@item polymorphed equipment|EM5E|polymorphed}"
				],
				[
					"61-70",
					"{@item psionic dampener|EM5E|dampening}"
				],
				[
					"71-80",
					"{@item quirky equipment|EM5E|quirky}"
				],
				[
					"81-90",
					"{@item racial enhancement equipment|EM5E|racial enhancing}"
				],
				[
					"91-100",
					"{@item weightless equipment|EM5E|weightless}"
				]
			]
		}
	],
	"item": [
	    {
	        "name": "Anything Item",
	        "source": "EM5E",
	        "type": "GV",
	        "tier": "minor",
	        "rarity": "common",
	        "wondrous":"true",
	        "entries": [
	            "This magic item may take the form of any item of equal rarity. As an action, the user may command the item to transform into one of three randomly chosen items, which are decided upon this item's creation. If using the transformed item would normally destroy the item or consume it somehow, the Anything Item is also destroyed."
	        ]
	    },
	    {
	        "name": "Aquatic Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous": false,
	        "entries": [
	        	"These weapons and suits of armor only gain their bonus while underwater. This equipment may also have the added effect of removing the usual penalties suffered when engaging in underwater combat without a swimming speed."
	        ]
	    },
	    {
	        "name": "Cloaked Wizardry",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous": true,
	        "entries": [
	        	"The item is magical but appears as a nomagical object to spells and effects that would detect its magical aura."
	        ]
	    },
	    {
	        "name": "Lightweight Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These items are half of the weight of their normal counterpart. Weapons of this sort count as magical for the sake of overcoming resistances."
	        ]
	    },
	    {
	        "name": "Miniature Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These are nonmagical items which have been magically shrunken down to a tiny size (that of a piece of jewellery). When the appropriate command word is spoken, they grow into their full-sized, nonmagical counterpart. When in miniature form, the weight is also reduced by an amount appropriate to the size reduction."
	        ]
	    },
	    {
	        "name": "Polymorphed Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"Typically seen in the form of a brooch, a ring, or a gem, these are items which, when a command word is uttered, can be turned into a weapon, armor, or shield."
	        ]
	    },
	    {
	        "name": "Psionic Dampener",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"Psionic dampeners are pieces of equipment or clothing that, when worn by a creature that uses psionics (i.e. {@creature mind flayer}), serves to reduce the spell save DC of psionically casted spells by 5. If a creature wearing a dampener decides to cast one of their psionic spells, they suffer a magical shock, taking 3 ({@dice 1d6}) points of lightning damage per the level of the spell that was cast. They can be removed as normal, thus these usually come in the form of manacles or other binding equipment."
	        ]
	    },
	    {
	        "name": "Weightless Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items have negligible weight, and can be carried without any encumberance, or can even magically lighten your burden."
	        ]
	    },
	    {
	        "name": "Quirky Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items come with {@dice 1d4-1} randomly determined quirks, according to the following table (ignoring duplicate rolls):",
	        	{
	        		"type": "table",
	        		"colStyles": [
	        			"col-2 text-center",
	        			"col-10"
	        		],
	        		"colLabels": [
	        			"d100",
	        			"Quirk"
	        		],
	        		"rows": [
	        			[
	        				"1-03",
	        				"It takes {@dice 1d3} rounds to fetch the item from a container such as a backpack or sack."
	        			],
	        			[
	        				"4-07",
	        				"The item appears decrepit, but its function remains unimpaired."
	        			],
	        			[
	        				"08-11",
	        				"The item lies dormant for {@dice 1d4} days after becoming attuned, during which it can't be used and it confers none of its magical properties."
	        			],
	        			[
	        				"12-16",
	        				"The item audibly buzzes when it is used, alerting everyone (that is not {@condition deafened}) within 60 feet of its presence."
	        			],
	        			[
	        				"17-20",
	        				"The item is outlined in any combination of blue, green, or violet light (DM's choice), shedding dim light in a 10-foot radius."
	        			],
	        			[
	        				"21-24",
	        				"The item is immune to nonmagical damage."
	        			],
	        			[
	        				"25-29",
	        				"The item can't be used and it confers none of its magical properties while the user wears any kind of head gear or adornment."
	        			],
	        			[
	        				"30-32",
	        				"The item can't be used and it confers none of its magical properties while underground."
	        			],
	        			[
	        				"33",
	        				"The item can't be used and it confers none of its magical properties while above ground."
	        			],
	        			[
	        				"34-36",
	        				"The item can't be used and it confers none of its magical properties while it is night."
	        			],
	        			[
	        				"37-38",
	        				"The item can't be used and it confers none of its magical properties while it is day."
	        			],
	        			[
	        				"39-43",
	        				"The item can't be harmed by blows dealt by a creature with a Strength score of 19 or below."
	        			],
	        			[
	        				"44-48",
	        				"The item has {@dice 2d20} charges, which may or may not be recharged (DM's choice)."
	        			],
	        			[
	        				"49-51",
	        				"The item functions {@chance 30|70 percent of the time|Item's function}, failing otherwise."
	        			],
	        			[
	        				"52-55",
	        				"The item is magically buoyant and {@spell levitate|phb|levitates} upward at a rate of 5 feet per round unless held or tied down."
	        			],
	        			[
	        				"56-60",
	        				"The item is immune to lightning damage, and is nonconductive."
	        			],
	        			[
	        				"61-64",
	        				"The item can only be used twice per day. An attempt to use it a third time results in the item losing its magical properties for 48 hours."
	        			],
	        			[
	        				"65-69",
	        				"The item causes its owner to become extremely possessive of it. If 14 days pass while the item is still on your person, you gain the following flaw: \"Anyone who even mentions my item covets it, and I will never let them have it.\" The flaw can only be removed by a {@spell remove curse} or greater."
	        			],
	        			[
	        				"70-72",
	        				"The item is more powerful than normal, raising any associated DC by 1, and increasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"73-78",
	        				"The item is less powerful than normal, lowering any associated DC by 1, and decreasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"79-83",
	        				"The item curses its owner with a -1 penalty to all saving throws until the item has a {@spell remove curse} cast upon it."
	        			],
	        			[
	        				"84-86",
	        				"The item can't be used and it confers none of its magical properties while submerged in water, unless it is designed to work underwater. In that case, it only functions underwater."
	        			],
	        			[
	        				"87-90",
	        				"The item belongs to an extraplanar creature or other powerful being who has imprinted a relevant symbol of theirs upon the item. After {@dice 1d4} weeks, the being becomes aware of the item's location and current user."
	        			],
	        			[
	        				"91-95",
	        				"The item can not be used more than once per minute."
	        			],
	        			[
	        				"96-98",
	        				"The item can only be destroyed as if it were an artifact."
	        			],
	        			[
	        				"99-00",
	        				"The item is sentient (roll on the tables in the {@book Creating Sentient Magic Items|DMG|7|creating sentient magic items} section of the Dungeon Master's Guide)."
	        			]
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Racial Enhancing Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"This equipment is only usable and only confers its benefits to a creature of a certain race. The DM can choose the race or can roll on the {@spell reincarnate} table."
	        ]
	    },
	    {
	        "name": "Abacus of Calculation",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
	        "entries": [
	        	"This device is a simple wooden frame, about 8 by 10 inches. Several heavy wires are strung across the frame, parallel to one another. On each wire are 10 wooden balls. When mathematical formulas involving numbers (adding, subtracting, multiplying, dividing and simple operations) are spoken near the object, the balls shift about and the answer is spoken aloud by a disembodied voice."
	        ]
	    },
	    {
	        "name": "Accelerator",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"This rapid-fire weapon is comparable to a ballista, which is intended for use on a spelljamming craft. The magic of this device is derived from the helm, and is rendered nonmagical when either the helm of the spelljammer, or the accelerator itself are not installed. This turret-like device looks like a gigantic sextant. The main arm is a 4-foot-long, 6-inch-diameter hollow tube with a hand-sized cup at one end. The arm can be swiveled and elevated allowing for accurate firing.",
	        	"To fire the accelerator, any small item can be placed in the cup-end of the arm, upon which it is magically seized and accelerated through the arm's length, and shot out the far end. It can be fired twice with one action and scores a critical hit on a roll of 19 or 20.",
	        	{
	        		"type":"entries",
	        		"name":"Accelerator Shot",
	        		"entries":[
	        			"{@i Ranged Weapon Attack:} {@hit +10} to hit, range 6,000/18,000 ft., one target. {@i Hit:} 22 ({@dice 4d10}) bludgeoning damage."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Acorn of Wo Mai",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "sentient": true,
	        "reqAttune": true,
	        "curse": true,
	        "wondrous":true,
	        "entries": [
	        	"The acorn of Wo Mai is a large lead vessel, dud gray in color. It is made in the likeness of a large acorn, 3 feet in height. Two golden bands inscribed with arcane characters encircle it from bottom to top, where they meet under a large seal of a dragon coiled around a sword. Although it looks heavy, the acorn weighs only 50 pounds. It occasionally makes faint thumping noises, and is warm to the touch.",
	        	"This lead vessel acts as the prison to a powerful and intelligent fiend, who would like nothing more than for someone to open the lid so it may be freed."
	        	{
	        		"type":"entries",
	        		"name":"Random Properties",
	        		"entries":[
	        			"The Acorn of Wo Mai has the following properties, determined by rolling on the tables in the \"Artifacts\" section in chapter 7 of the Dungeon Master's Guide:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"1 {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial property}",
	        					"2 {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial properties}"
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Polymorph",
	        		"entries":[
	        			"The Acorn of Wo Mai can be used to cast the {@spell true polymorph} spell (object into creature only) once per day, regaining its use daily at dawn."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Sentience",
	        		"entries":[
	        			"The Acorn of Wo Mai acts as a sentient lawful evil magic item with an Intelligence of 20, a Wisdom of 15, and a Charisma of 24. It has hearing and {@sense darkvision} out to a range of 120 feet. It can communicate telepathically with the creature that is attuned to it, as long as that creature understands at least one language.",
	        			"If it is made evident to the fiend that its user has no intention of releasing it, the fiend attempts to take control of its owner (see \"Sentient Magic Items\" in chapter 7 of the Dungeon Master's Guide)."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Personality",
	        		"entries":[
	        			"The Acorn of Wo Mai is a cunning fiend that uses its charm and wit to try and persuade others to free it, offering some of its immense power in exchange. It often gives good advice and answers harmless questions to build trust with its user."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Air Spores",
	        "source": "EM5E",
	        "poison":true,
	        "rarity": "uncommon",
	        "tier": "Minor",
	        "wondrous":true,
	        "entries": [
	        	"Once inhaled, the air spores inhabit your lungs, and you find it difficult to breathe normally.",
	        	"While these spores inhabit your lungs, you can't run out of oxygen in any environment; however, you have disadvantage on any Constitution saving throws.",
	        	"The spores will die after {@dice 2d4} days.",
	        	{
	        		"type":"inset",
	        		"name":"Variant: Chandrasakar's Air Spores",
	        		"entries":[
	        			"This variant of Air Spores is transmittable to a willing creature or one that is {@condition incapacitated}."
	        		]
	        	}
	        ],
	        "poisontypes":[
	        	"inhaled"
	        ]
	    },
	    {
	        "name": "Al-Azid's Ghostly Palace",
	        "source": "EM5E",
	        "rarity": "Legendary",
	        "tier": "Major",
	        "cursed":true,
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"This item comes in the form of an ornate key. You can use an action to turn it as if you were unlocking a door, causing a huge palace of fine white marble and slender minarets to be called into existence. The palace is only visible at night. During the day, it is invisible from the outside.",
	        	"The chambers are attended to by unseen servants, keeping it hospitable and taking care of any upkeep.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"This key is cursed, and becoming attuned to it extends the curse to you. Every day at dusk, there is a {@chance 30} that a hostile {@creature invisible stalker} is summoned within 30 feet of you and attacks."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of the Abyss",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":"by an evil creature",
	        "reqAttuneTags":[
	        	{
	        		"alignment":[
	        			"E"
	        		]
	        	}	
	        ],
	        "wondrous":true,
	        "entries": [
	        	"This adamantine amulet hangs from a long silver chain. Twice per day, you may spend 10 minutes in concentration (as if concentrating on a spell), immediately after which casting the {@spell summon lesser demons|XGE}. When cast from this amulet, the spell requires no concentration and instead lasts {@dice 3d6} hours. Throughout this duration, the summoned creatures obey any commands from you and can be dismissed by you as an action.",
	        	"Once every 30 days, the {@spell contact other plane} spell can be cast, mentally contacting a powerful fiend from the abyss."
	        ],
	        "attachedSpells":[
	        	"summon lesser demons",
	        	"contact other plane"
	        ]
	    },
	    {
	        "name": "Amulet of Amiability",
	        "source": "EM5E",
	        "rarity": "Very Rare",
	        "tier": "Major",
	        "reqAttune":true,
	        "cursed":true,
	        "wondrous":true,
	        "entries": [
	        	"You gain a +3 bonus to AC and saving throws while wearing this amulet.",
	        	"As an action, you can conjure {@dice 1d6} magical chocolate chip cookies or fresh flowers."
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"This item is cursed. Attuning to it curses you until you are targeted by the {@spell remove curse} spell or similar magic. While cursed, you are unwilling to part with the amulet. As part of this curse, you become incredibly kind to the point of being unable to wilfully hurt another creature of any type. You refuse to take treasure that belongs to someone else, and if you are confronted by a hostile creature you try to resolve any conflicts with gifts in the hopes of a peaceful outcome."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Arachnid Control",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "wondrous":true,
	        "reqAttune":true,
	        "entries": [
	        	"Arachnids of any type can magically understand you and your instructions.",
	        	"As a bonus action, you can attempt to control a single arachnid. They must succeed a DC 15 Wisdom saving throw or become {@condition charmed} by you for 24 hours, during which they must obey any commands even if it puts them in harms way. Arachnids of Intelligence score 3 or below automatically fail this saving throw. You must wait until dawn of the next day before using this ability again.",
	        	"Valid arachnids include {@creature giant spider|mm|giant spiders}, {@creature swarm of spiders}, {@creature giant scorpion}, {@creature choldrith|vgm}, {@creature drider}, as well as creatures that magically assume the form of an arachnid."
	        ]
	    },
	    {
	        "name": "Amulet of the Beast",
	        "source": "EM5E",
	        "rarity": "",
	        "type":"GV",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Amulet of the Cairn Hills",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"You make saving throws against any effect that would drain your ability score or change your age at advantage."
	        ]
	    },
	    {
	        "name": "Cartographer's Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"Once every three days, as an action, you may utter the command word to activate this amulet, causing it to display an illusory map depending on whether you are outdoors or indoors for 6 seconds.",
	        	{
	        		"type":"entries",
	        		"name":"Outdoors",
	        		"entries":[
	        			"The amulet displays the surrounding area within 10 miles of the amulet and indicates true north. It shows only the most obvious features of the landscape such as hills, cave mouths, buildings."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Indoors",
	        		"entries":[
	        			"The amulet displays the area within 60 feet, showing passages, stairways, doors, and other normal features such as fountains, furnishings, and loose treasure. The map does not reveal secrets, traps, or other creatures."
	        		]
	        	},
	        	"While activated, the user who invoked the map can name up to four objects with which they are familiar. If any of the items exist in the map's area, their location is revealed."
	        ]
	    },
	    {
	        "name": "Amulet of Caterpillar Control",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
	        "entries": [
	        	"You can control caterpillars at will as if you had cast the {@spell dominate monster} spell on them. You can control up to {@dice 4d6} caterpillars in this way at the same time."
	        ]
	    },
	    {
	        "name": "Amulet of Charm Resistance",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this amulet you have advantage on saving throws made to resist effects that would {@condition charmed||charm} you."
	        ]
	    },
	    {
	        "name": "Amulet of Charming",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this amulet, your Charisma score increases by 2, to a maximum of 20.",
	        	"When a creature sees the amulet, they must succeed a DC 15 Wisdom saving throw or become {@condition charmed} by the you for 1 hour or until you or your companions do anything harmful to it. A creature can only be subjected to this ability once every 24 hours."
	        ]
	    },
	    {
	        "name": "Amulet of Cheetah Speed",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this amulet, your speed increases by 10 feet. In addition you can use an action to cause your walking speed to become 50 feet, unless your walking speed is higher. This lasts for 1 minute, during which you can {@action dash} as a bonus action. Once used, this ability can't be used again until you finish a long rest.",
	        	"While wearing armor of any kind, this amulet confers no benefits to you and its properties can't be used."
	        ]
	    },
	    {
	        "name": "Amulet of Dragon Warding",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"A creature that touches the amulet gains an intuitive understanding of its properties, as if they had cast the {@spell identify} spell.",
	        	"While wearing this amulet, you gain a +2 bonus to AC if you are wearing no armor and using no shield.",
	        	"Additionally, while wearing this amulet, you have advantage on saving throws against any spell that targets only you (not in an area of effect). If you roll a 20 for the save and the spell is 5th level or lower, the spell has no effect on you and instead targets the caster, using the slot level, spell save DC, attack bonus, and spellcasting ability of the caster."
	        ]
	    },
	    {
	        "name": "Amulet of Dramatic Death",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this amulet, as a reaction when you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You immediately turn {@condition invisible} and an illusion of yourself dying takes your place. The illusion does not hold up to physical inspection, but eludes all visual inspection unless by way of magic.",
	        	{
	        		"type":"inset",
	        		"entries":[
	        			"Typically, these amulets are made to protect only against a single type of attack or damage type. Example limitations would be cold damage, weapon attacks that aren't silvered, or an undead creature's attacks."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Draskilion's Amulet of Life",
	        "source": "EM5E",
	        "rarity": "Artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "cursed":true,
	        "entries": [
	        	"The first creature to touch this amulet after its construction becomes immediately attuned to it.",
	        	"If you die while wearing this amulet, your soul enters it. While your soul is in the amulet, you have darkvision out to 120 feet and are aware of your environment.",
	        	"As an action, the soul housed in the amulet can attempt to dominate a wearer. The wearer must succeed a DC 20 Charisma saving throw. On a failure, the soul immediately initiate a contested Intelligence check with the wearer. If the soul is successful, it dominates the wearer, transferring the wearer's soul into the amulet and inhabiting the wearer's body. The wearer then adopts the dominating soul's mental statistics (Intelligence, Wisdom, Charisma, and alignment), but retains all other ability scores and statistics, including class levels and spells. If instead the wearer wins the contest, they gain 1 level of exhaustion from mental fatigue, but remain unaware of the soul's attempt to dominate them.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"A creature attempting to remove the amulet must use an action to do so, and must make a DC 25 Wisdom saving throw. On a failure, the creature is unwilling to remove the amulet. On a success, the creature removes the amulet from their person. If a {@spell remove curse} spell or greater magic is cast upon the amulet, the wearer can remove the amulet using an object interaction."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Emotions",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
	        "cursed":true,
	        "entries": [
	        	"While wearing this amulet, your appearance is altered to greatly exaggerate your emotional state.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"A creature who puts this amulet on can't willingly remove it."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Extension",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"This amulet has 10 charges. When you cast a spell that has a duration of 1 minute or longer while wearing it, you can expend an amount of charges equal to the spell's level to double the duration, up to 24 hours. It regains 1d8+2 charges at dawn."
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    }
	],
	/*"book":[
		{
			"name":"",
			"id":"",
			"source":"",
			"contents":[
				{
					"name":"",
					"headers":[
						""
					]
				}
			]
		}
	],
	"bookData":[
		{
			"id":"",
			"source":"",
			"data":[
				{
					
				}
			]
		}
	]*/
	/*"adventure":[
		{
			"name":"",
			"id":"",
			"source":"",
			"coverUrl":"",
			"published":"",
			"storyline":"",
			"level":{
				"start": 1,
				"end": 20
			},
			"contents":[
				{
					"name":"",
					"headers":[
						"",
						""
					]
				}
			]
		}
	],
	"adventureData":[
		{
			"id":"",
			"source":"",
			"data":[
				{

				}
			]
		}
	]*/
	/*"reward":[
		{
			"type":"boon",
			"name":"",
			"source":"",
			"entries":[
				""
			]
		}
	]*/
	/*"table":[
		{
			"name":"",
			"source":"",
			"colLabels":[
				"",
				""
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"",
					""
				]
			]
		},
		{
			"name":"",
			"caption":"",
			"source":"",
			"colLabels":[
				"d20",
				""
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					""
				],
				[
					"2",
					""
				],
				[
					"3",
					""
				],
				[
					"4",
					""
				],
				[
					"5",
					""
				],
				[
					"6",
					""
				],
				[
					"7",
					""
				],
				[
					"8",
					""
				],
				[
					"9",
					""
				],
				[
					"10",
					""
				],
				[
					"11",
					""
				],
				[
					"12",
					""
				],
				[
					"13",
					""
				],
				[
					"14",
					""
				],
				[
					"15",
					""
				],
				[
					"16",
					""
				],
				[
					"17",
					""
				],
				[
					"18",
					""
				],
				[
					"19",
					""
				],
				[
					"20",
					""
				]
			]
		}
	]*/
}