{
	"_meta":{
		"sources":[
			{
				"json":"EM5E",
				"abbreviation":"EM5E",
				"full":"Encyclopedia Magica for 5e",
				"authors":[
					"Zuishin"
				],
				"convertedBy":[
					"Zuishin"
				],
				"color":"113560",
				"version":"1.0",
				"url":"https://github.com/ZuishinGit/ZuishinHomebrew/tree/master",
				"targetSchema":"1.0.0"
			}
		]
	},
	"table":[
		{
			"name":"Random Artifact Powers: Abjuration",
			"source":"EM5E",
			"caption": "Abjuring Effects of Artifacts",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cast {@spell banishment} (1/Week)"
				],
				[
					"2",
					"Cast {@spell antilife shell}, affecting one of the following creature types: aberrations, celestials, elementals, fey, fiends, or undead (1/Day)"
				],
				[
					"3",
					"Cast {@spell banishment} with range: touch (1/Day)"
				],
				[
					"4",
					"Instantly dismiss an elemental (1/Week)"
				],
				[
					"5",
					"Cast {@spell planar binding} (1/Week)"
				],
				[
					"6",
					"Cast {@spell dispel evil and good} (1/Day)"
				],
				[
					"7",
					"Cast {@spell dispel magic} (1/Day)"
				],
				[
					"8",
					"Cast {@spell holy aura} (1/Week)"
				],
				[
					"9",
					"Cast {@spell banishment}, sending a creature to a plane of the DM's choice (1/Week)"
				],
				[
					"10",
					"Cast {@spell imprisonment} (1/Month)"
				],
				[
					"11",
					"Cast {@spell knock} (3/Day)"
				],
				[
					"12",
					"Cast {@spell primordial ward} (1/Day)"
				],
				[
					"13",
					"Gain the following trait while holding the artifact: When you make a successful saving throw against a spell of 2nd level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"14",
					"Cast {@spell purify food and drink} (At will)"
				],
				[
					"15",
					"Cast {@spell remove curse} (3/Day)"
				],
				[
					"16",
					"Constantly repel all insects within 10 feet of the artifact"
				],
				[
					"17",
					"Cast {@spell magic circle} (1/Week)"
				],
				[
					"18",
					"Gain the following trait while holding the artifact: Once per day, when you make a successful saving throw against a spell of 7th level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"19",
					"Dispel illusions within a 60-foot radius (3/Day)"
				],
				[
					"20",
					"Have the {@spell resistance} spell continually in effect while the artifact is in hand"
				]
			]
		},
		{
			"name":"Random Artifact Powers: Cataclysm",
			"source":"EM5E",
			"caption":"Cataclysmic Effects of Artifacts",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cause acid rain to fall (see the second round effect of the {@storm of vengeance} spell)"
				],
				[
					"2",
					"Create a permanent aura of {@hazard desecrated ground}, in which plants twist and wither, crops fail, and herds grow sickly"
				],
				[
					"3",
					"Blanket the area in a {@hazard blizzard} that lasts {@dice 1d6 + 12} hours"
				],
				[
					"4",
					"Create a storm of lightning that lasts 3 days, with lightning striking every 10 minutes per the {@spell call lightning} spell"
				],
				[
					"5",
					"Create an immobile {@spell cloudkill} spell for {@dice 1d6} hours"
				],
				[
					"6",
					"Form a ring of creeping doom in the area, taking 4 hours to reach the center. Until then, the area is infested with hazardous dark tendrils, per the {@spell arms of hadar} spell"
				],
				[
					"7",
					"Settle a fog of death over the area, which is fatal to creatures that stay in it for more than a day. The fog lasts {@dice 2d20} hours"
				],
				[
					"8",
					"Cause a permanent drought in the area"
				],
				[
					"9",
					"Cause an earthquake centered on the artifact, per the {@spell earthquake} spell"
				],
				[
					"10",
					"Call down a series of {@1d6} {@spell sunburst||sunbursts} within the area"
				],
				[
					"11",
					"Flood the area, per the {@spell tsunami} spell"
				],
				[
					"12",
					"Sweep an incendiary cloud through the entire area"
				],
				[
					"13",
					"Settle a plague of insects upon the area for {@dice 1d6} hours"
				],
				[
					"14",
					"Instantly create a permanent {@spell antimagic field} over the area"
				],
				[
					"15",
					"Call down a {@spell meteor swarm} that lasts for {@dice 1d12} hours (480 meteors per hour), randomly striking targets within the area"
				],
				[
					"16",
					"Create a permanent area which drains one point of a creature's Strength score for every 24 hours they spend in the area. A creature dies if this reduces its Strength to 0. The reduction lasts until the creature finishes a short or long rest outside of the area"
				],
				[
					"17",
					"Create a permanent wild magic zone (roll on the {@table Wild Magic Surge} table in the Player's Handbook whenever a spell is cast within the zone)"
				],
				[
					"18",
					"Transfer the whole area to a randomly chosen plane. The artifact is not transported"
				],
				[
					"19",
					"Strike the entire area with a {@spell storm of vengeance}"
				],
				[
					"20",
					"Create permanent wolf spirits to guard the area of effect, which are hostile to all creatures except beasts, plants, and constructs"
				]
			]
		},
		{
			"name":"Random Enhancements",
			"caption":"Magic items and their enhancements",
			"source":"EM5E",
			"colLabels":[
				"d100",
				"Enhancement Type"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1-10",
					"{@item anything item|EM5E|anything}"
				],
				[
					"11-20",
					"{@item aquatic equipment|EM5E|aquatic}"
				],
				[
					"21-30",
					"{@item cloaked wizardry|EM5E|cloaked}"
				],
				[
					"31-40",
					"{@item lightweight equipment|EM5E|lightweight}"
				],
				[
					"41-50",
					"{@item miniature equipment|EM5E|miniature}"
				],
				[
					"51-60",
					"{@item polymorphed equipment|EM5E|polymorphed}"
				],
				[
					"61-70",
					"{@item psionic dampener|EM5E|dampening}"
				],
				[
					"71-80",
					"{@item quirky equipment|EM5E|quirky}"
				],
				[
					"81-90",
					"{@item racial enhancing equipment|EM5E|racial enhancing}"
				],
				[
					"91-100",
					"{@item weightless equipment|EM5E|weightless}"
				]
			]
		}
	],
	"item": [
	    {
	        "name": "Anything Item",
	        "source": "EM5E",
	        "type": "GV",
	        "tier": "minor",
	        "rarity": "common",
	        "wondrous":"true",
	        "entries": [
	            "This magic item may take the form of any item of equal rarity. As an action, the user may command the item to transform into one of three randomly chosen items, which are decided upon this item's creation. If using the transformed item would normally destroy the item or consume it somehow, the Anything Item is also destroyed."
	        ]
	    },
	    {
	        "name": "Aquatic Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous": false,
	        "entries": [
	        	"These weapons and suits of armor only gain their bonus while underwater. This equipment may also have the added effect of removing the usual penalties suffered when engaging in underwater combat without a swimming speed."
	        ]
	    },
	    {
	        "name": "Cloaked Wizardry",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous": true,
	        "entries": [
	        	"The item is magical but appears as a nomagical object to spells and effects that would detect its magical aura."
	        ]
	    },
	    {
	        "name": "Lightweight Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These items are half of the weight of their normal counterpart. Weapons of this sort count as magical for the sake of overcoming resistances."
	        ]
	    },
	    {
	        "name": "Miniature Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These are nonmagical items which have been magically shrunken down to a tiny size (that of a piece of jewellery). When the appropriate command word is spoken, they grow into their full-sized, nonmagical counterpart. When in miniature form, the weight is also reduced by an amount appropriate to the size reduction."
	        ]
	    },
	    {
	        "name": "Polymorphed Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"Typically seen in the form of a brooch, a ring, or a gem, these are items which, when a command word is uttered, can be turned into a weapon, armor, or shield."
	        ]
	    },
	    {
	        "name": "Psionic Dampener",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"Psionic dampeners are pieces of equipment or clothing that, when worn by a creature that uses psionics (i.e. {@creature mind flayer}), serves to reduce the spell save DC of psionically casted spells by 5. If a creature wearing a dampener decides to cast one of their psionic spells, they suffer a magical shock, taking 3 ({@dice 1d6}) points of lightning damage per the level of the spell that was cast. They can be removed as normal, thus these usually come in the form of manacles or other binding equipment."
	        ]
	    },
	    {
	        "name": "Weightless Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items have negligible weight, and can be carried without any encumberance, or can even magically lighten your burden."
	        ]
	    },
	    {
	        "name": "Quirky Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items come with {@dice 1d4-1} randomly determined quirks, according to the following table (ignoring duplicate rolls):",
	        	{
	        		"type": "table",
	        		"colStyles": [
	        			"col-2 text-center",
	        			"col-10"
	        		],
	        		"colLabels": [
	        			"d100",
	        			"Quirk"
	        		],
	        		"rows": [
	        			[
	        				"1-03",
	        				"It takes {@dice 1d3} rounds to fetch the item from a container such as a backpack or sack."
	        			],
	        			[
	        				"4-07",
	        				"The item appears decrepit, but its function remains unimpaired."
	        			],
	        			[
	        				"08-11",
	        				"The item lies dormant for {@dice 1d4} days after becoming attuned, during which it can't be used and it confers none of its magical properties."
	        			],
	        			[
	        				"12-16",
	        				"The item audibly buzzes when it is used, alerting everyone (that is not {@condition deafened}) within 60 feet of its presence."
	        			],
	        			[
	        				"17-20",
	        				"The item is outlined in any combination of blue, green, or violet light (DM's choice), shedding dim light in a 10-foot radius."
	        			],
	        			[
	        				"21-24",
	        				"The item is immune to nonmagical damage."
	        			],
	        			[
	        				"25-29",
	        				"The item can't be used and it confers none of its magical properties while the user wears any kind of head gear or adornment."
	        			],
	        			[
	        				"30-32",
	        				"The item can't be used and it confers none of its magical properties while underground."
	        			],
	        			[
	        				"33",
	        				"The item can't be used and it confers none of its magical properties while above ground."
	        			],
	        			[
	        				"34-36",
	        				"The item can't be used and it confers none of its magical properties while it is night."
	        			],
	        			[
	        				"37-38",
	        				"The item can't be used and it confers none of its magical properties while it is day."
	        			],
	        			[
	        				"39-43",
	        				"The item can't be harmed by blows dealt by a creature with a Strength score of 19 or below."
	        			],
	        			[
	        				"44-48",
	        				"The item has {@dice 2d20} charges, which may or may not be recharged (DM's choice)."
	        			],
	        			[
	        				"49-51",
	        				"The item functions {@chance 70|70 percent of the time|Item's function}, failing otherwise."
	        			],
	        			[
	        				"52-55",
	        				"The item is magically buoyant and {@spell levitate|phb|levitates} upward at a rate of 5 feet per round unless held or tied down."
	        			],
	        			[
	        				"56-60",
	        				"The item is immune to lightning damage, and is nonconductive."
	        			],
	        			[
	        				"61-64",
	        				"The item can only be used twice per day. An attempt to use it a third time results in the item losing its magical properties for 48 hours."
	        			],
	        			[
	        				"65-69",
	        				"The item causes its owner to become extremely possessive of it. If 14 days pass while the item is still on your person, you gain the following flaw: \"Anyone who even mentions my item covets it, and I will never let them have it.\" The flaw can only be removed by a {@spell remove curse} or greater."
	        			],
	        			[
	        				"70-72",
	        				"The item is more powerful than normal, raising any associated DC by 1, and increasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"73-78",
	        				"The item is less powerful than normal, lowering any associated DC by 1, and decreasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"79-83",
	        				"The item curses its owner with a -1 penalty to all saving throws until the item has a {@spell remove curse} cast upon it."
	        			],
	        			[
	        				"84-86",
	        				"The item can't be used and it confers none of its magical properties while submerged in water, unless it is designed to work underwater. In that case, it only functions underwater."
	        			],
	        			[
	        				"87-90",
	        				"The item belongs to an extraplanar creature or other powerful being who has imprinted a relevant symbol of theirs upon the item. After {@dice 1d4} weeks, the being becomes aware of the item's location and current user."
	        			],
	        			[
	        				"91-95",
	        				"The item can not be used more than once per minute."
	        			],
	        			[
	        				"96-98",
	        				"The item can only be destroyed as if it were an artifact."
	        			],
	        			[
	        				"99-00",
	        				"The item is sentient (roll on the tables in the {@book Creating Sentient Magic Items|DMG|7|creating sentient magic items} section of the Dungeon Master's Guide)."
	        			]
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Racial Enhancing Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"This equipment is only usable and only confers its benefits to a creature of a certain race. The DM can choose the race or can roll on the {@spell reincarnate} table."
	        ]
	    },
	    {
	        "name": "Abacus of Calculation",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"When mathematical formulas involving numbers (adding, subtracting, multiplying, dividing and simple operations) are spoken near this abacus, the balls shift and the answer is spoken aloud by a magical, disembodied voice."
	        ]
	    },
	    {
	        "name": "Accelerator",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "wondrous":true,
			"weight": 200,
	        "entries": [
	        	"This rapid-fire weapon is comparable to a ballista and is intended for use on a spelljamming craft. The magic of this device is derived from the helm, and is rendered nonmagical when either the helm of the spelljammer, or the accelerator itself are not installed. This turret-like device looks like a gigantic sextant. The main arm is a 4-foot-long, 6-inch-diameter hollow tube with a hand-sized cup at one end. The arm can be swiveled and elevated allowing for accurate firing.",
	        	"To fire the accelerator, any small item can be placed in the cup-end of the arm, upon which it is magically seized and accelerated through the arm's length, and shot out the far end. It can be fired twice with one action and scores a critical hit on a roll of 19 or 20.",
	        	{
	        		"type":"entries",
	        		"name":"Accelerator Shot",
	        		"entries": [
	        			"{@i Ranged Weapon Attack:} {@hit +10} to hit, range 6,000/18,000 ft., one target. {@i Hit:} 22 ({@dice 4d10}) bludgeoning damage."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Acorn of Wo Mai",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "sentient": true,
	        "reqAttune": true,
	        "wondrous":true,
			"weight": 40,
	        "entries": [
	        	"The acorn of Wo Mai is a large lead vessel, dud gray in color. It is made in the likeness of a large acorn, 3 feet in height. Two golden bands inscribed with arcane characters encircle it from bottom to top, where they meet under a large seal of a dragon coiled around a sword. Although it looks heavy, the acorn weighs only 50 pounds. It occasionally makes faint thumping noises, and is warm to the touch.",
	        	"This lead vessel acts as the prison to a powerful and intelligent evil fiend, who would like nothing more than for someone to open the lid so it may be freed.",
	        	{
	        		"type":"entries",
	        		"name":"Random Properties",
	        		"entries": [
	        			"The Acorn of Wo Mai has the following properties, determined by rolling on the tables in the \"Artifacts\" section in chapter 7 of the Dungeon Master's Guide:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"1 {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial property}",
	        					"2 {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial properties}"
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Polymorph",
	        		"entries": [
	        			"The {@i Acorn of Wo Mai} can be used to cast the {@spell true polymorph} spell (object into creature only) as an action once per day, regaining its use daily at dawn."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Hallowed Advisor",
	        		"entries":[
	        			"As an action, you can cast the {@spell contact other plane} spell, contacting the fiend bound by the acorn. With this casting of the spell, when you fail your saving throw, instead of being driven insane or taking damage you are {@condition charmed} by the imprisoned fiend. Each consecutive casting of this spell before finishing a long rest raises the DC by 1."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Sentience",
	        		"entries": [
	        			"The Acorn of Wo Mai acts as a sentient lawful evil magic item with an Intelligence of 20, a Wisdom of 15, and a Charisma of 24. It has hearing and {@sense darkvision} out to a range of 120 feet. It can communicate telepathically with the creature that is attuned to it, as long as that creature understands at least one language.",
	        			"If it is made evident to the fiend that its user has no intention of releasing it, the fiend attempts to take control of its owner (see \"Sentient Magic Items\" in chapter 7 of the Dungeon Master's Guide)."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Personality",
	        		"entries": [
	        			"The Acorn of Wo Mai is a cunning fiend that uses its charm and wit to try and persuade others to free it, offering some of its immense power in exchange. It often gives good advice and answers harmless questions to build trust with its user."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Air Spores",
	        "source": "EM5E",
	        "poison":true,
	        "rarity": "uncommon",
	        "tier": "Minor",
	        "wondrous":true,
	        "entries": [
	        	"Once inhaled, the air spores inhabit your lungs, and you find it difficult to breathe normally.",
	        	"While these spores inhabit your lungs, you can't run out of oxygen in any environment; however, you have disadvantage on any Constitution saving throws.",
	        	"The spores will die after {@dice 2d4} days.",
	        	{
	        		"type":"inset",
	        		"name":"Variant: Chandrasakar's Air Spores",
	        		"entries": [
	        			"This variant of Air Spores is transmittable to a willing creature or one that is {@condition incapacitated}."
	        		]
	        	}
	        ],
	        "poisontypes":[
	        	"inhaled"
	        ]
	    },
	    {
	        "name": "Al-Azid's Ghostly Palace",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "Major",
	        "curse":true,
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 0.5,
	        "entries": [
	        	"This item comes in the form of an ornate key. You can use an action to turn it as if you were unlocking a door, causing a huge palace of fine white marble and slender minarets to be called into existence. The palace is only visible at night. During the day, it is invisible from the outside.",
	        	"The chambers are attended to by unseen servants, keeping it hospitable and taking care of any upkeep.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This key is cursed, and becoming attuned to it extends the curse to you. Every day at dusk, there is a {@chance 30} that a hostile {@creature invisible stalker} is summoned within 30 feet of you and attacks."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of the Abyss",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":"by an evil creature",
	        "reqAttuneTags":[
	        	{
	        		"alignment":[
	        			"E"
	        		]
	        	}	
	        ],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This adamantine amulet hangs from a long silver chain. Twice per day, you may spend 10 minutes in concentration (as if concentrating on a spell), immediately after which casting the {@spell summon lesser demons|XGE}. When cast from this amulet, the spell requires no concentration and instead lasts {@dice 3d6} hours. Throughout this duration, the summoned creatures obey any commands from you and can be dismissed by you as an action.",
	        	"Once every 30 days, the {@spell contact other plane} spell can be cast, mentally contacting a powerful fiend from the abyss."
	        ],
	        "attachedSpells":[
	        	"summon lesser demons",
	        	"contact other plane"
	        ]
	    },
	    {
	        "name": "Amulet of Amiability",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "reqAttune":true,
	        "curse":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You gain a +3 bonus to AC and saving throws while wearing this amulet.",
	        	"As an action, you can conjure {@dice 1d6} magical chocolate chip cookies or fresh flowers at will.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. Attuning to it curses you until you are targeted by the {@spell remove curse} spell or similar magic. While cursed, you are unwilling to part with the amulet. As part of this curse, you become incredibly kind to the point of being unable to wilfully hurt another creature of any type. You refuse to take treasure that belongs to someone else, and if you are confronted by a hostile creature you try to resolve any conflicts with gifts in the hopes of a peaceful outcome."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Arachnid Control",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "wondrous":true,
	        "reqAttune":true,
			"weight": 1,
	        "entries": [
	        	"Arachnids of any type can magically understand you and your instructions.",
	        	"As a bonus action, you can attempt to control a single arachnid. They must succeed a DC 15 Wisdom saving throw or become {@condition charmed} by you for 24 hours, during which they must obey any commands even if it puts them in harms way. Arachnids of Intelligence score 3 or below automatically fail this saving throw. You must wait until dawn of the next day before using this ability again.",
	        	"Valid arachnids include {@creature giant spider|mm|giant spiders}, {@creature swarm of spiders}, {@creature giant scorpion}, {@creature choldrith|vgm}, {@creature drider}, as well as creatures that magically assume the form of an arachnid."
	        ]
	    },
	    {
	        "name": "Amulet of the Beast (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "type":"GV",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Amulet of the Cairn Hills",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You have advantage on any saving throws made against an effect that would drain your ability scores or change your age."
	        ]
	    },
	    {
	        "name": "Cartographer's Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 3,
	        "entries": [
	        	"Once every three days, as an action, you may utter the command word to activate this amulet, causing it to display an illusory map depending on whether you are outdoors or indoors for 6 seconds.",
	        	{
	        		"type":"entries",
	        		"name":"Outdoors",
	        		"entries": [
	        			"The amulet displays the surrounding area within 10 miles of the amulet and indicates true north. It shows only the most obvious features of the landscape such as hills, cave mouths, buildings."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Indoors",
	        		"entries": [
	        			"The amulet displays the area within 60 feet, showing passages, stairways, doors, and other normal features such as fountains, furnishings, and loose treasure. The map does not reveal secrets, traps, or other creatures."
	        		]
	        	},
	        	"While activated, the user who invoked the map can name up to four objects with which they are familiar. If any of the items exist in the map's area, their location is revealed."
	        ]
	    },
	    {
	        "name": "Amulet of Caterpillar Control",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You can control caterpillars at will as if you had cast the {@spell dominate monster} spell on them. You can control up to {@dice 4d6} caterpillars in this way at the same time."
	        ]
	    },
	    {
	        "name": "Amulet of Charm Resistance",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet you have advantage on saving throws made to resist effects that would {@condition charmed||charm} you."
	        ]
	    },
	    {
	        "name": "Amulet of Charming",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "ability": {
	        	"cha": 2
	        },
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, your Charisma score increases by 2, to a maximum of 20.",
	        	"When a creature sees the amulet, they must succeed a DC 15 Wisdom saving throw or become {@condition charmed} by the you for 1 hour or until you or your companions do anything harmful to it. A creature can only be subjected to this ability once every 24 hours."
	        ]
	    },
	    {
	        "name": "Amulet of Cheetah Speed",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, your speed increases by 10 feet. In addition you can use an action to cause your walking speed to become 50 feet, unless your walking speed is higher. This lasts for 1 minute, during which you can {@action dash} as a bonus action. Once used, this ability can't be used again until you finish a long rest.",
	        	"While wearing armor of any kind, this amulet confers no benefits to you and its properties can't be used."
	        ]
	    },
	    {
	        "name": "Amulet of Dragon Warding",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "bonusAc": "+2",
	        "entries": [
	        	"A creature that touches the amulet gains an intuitive understanding of its properties, as if they had cast the {@spell identify} spell.",
	        	"While wearing this amulet, you gain a +2 bonus to AC if you are wearing no armor and using no shield.",
	        	"Additionally, while wearing this amulet, you have advantage on saving throws against any spell that targets only you (not in an area of effect). If you roll a 20 for the save and the spell is 5th level or lower, the spell has no effect on you and instead targets the caster, using the slot level, spell save DC, attack bonus, and spellcasting ability of the caster."
	        ]
	    },
	    {
	        "name": "Amulet of Dramatic Death",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, as a reaction when you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You immediately turn {@condition invisible} and an illusion of yourself dying takes your place. The illusion does not hold up to physical inspection, but eludes all visual inspection unless by way of magic.",
	        	{
	        		"type":"inset",
	        		"entries": [
	        			"Typically, these amulets are made to protect only against a single type of attack or damage type. Example limitations would be cold damage, weapon attacks that aren't silvered, or an undead creature's attacks."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Draskilion's Amulet of Life",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"The first creature to touch this amulet after its construction becomes immediately attuned to it.",
	        	"If you die while wearing this amulet, your soul enters it. While your soul is in the amulet, you have darkvision out to 120 feet and are aware of your environment.",
	        	"As an action, the soul housed in the amulet can attempt to dominate a wearer. The wearer must succeed a DC 20 Charisma saving throw. On a failure, the soul can immediately initiate a contested Intelligence check with the wearer. If the soul is successful, it dominates the wearer, transferring the wearer's soul into the amulet and inhabiting the wearer's body. The wearer then adopts the dominating soul's mental statistics (Intelligence, Wisdom, Charisma, and alignment), but retains all other ability scores and statistics, including class levels and spells. If instead the wearer wins the contest, they gain 1 level of exhaustion from mental fatigue to a maximum of 5 points of exhaustion, but remain unaware of the soul's attempt to dominate them.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"A creature attempting to remove the amulet must use an action to do so, and must make a DC 25 Wisdom saving throw. On a failure, the creature is unwilling to remove the amulet. On a success, the creature removes the amulet from their person. If a {@spell remove curse} spell or greater magic is cast upon the amulet, the wearer can remove the amulet using an object interaction."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Emotions",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, your appearance is altered to greatly exaggerate your emotional state.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"A creature who puts this amulet on can't willingly remove it."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Extension",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet has 10 charges. When you cast a spell that has a duration of 1 minute or longer while wearing it, you can expend an amount of charges equal to the spell's level to double the duration, up to 24 hours. It regains {@dice 1d8+2} charges at dawn."
	        ]
	    },
	    {
	        "name": "Amulet of Finding",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"{@i Amulets of Finding} come in pairs. Anyone wearing one of the amulets can use an action to see through the matching amulet. A creature perceiving through an amulet in this way retains their senses."
	        ]
	    },
	    {
	        "name": "Furyondy's Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
	        "reqAttune": true,
			"weight": 1,
			"charges":7,
	        "entries": [
	        	"This amulet has 7 charges, and can't be recharged.",
	        	"While wearing it, you can expend one charge to cast the {@spell remove curse} spell as an action. When cast from this amulet, the spell has a range of self."
	        ],
	        "attachedSpells":[
	        	"remove curse"
	        ]
	    },
	    {
	        "name": "Amulet of the Golden Collar",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you can use it to cast the {@spell freedom of movement} spell as an action. This property can't be used again until the next dawn."
	        ],
	        "attachedSpells":[
	        	"freedom of movement"
	        ]
	    },
	    {
	        "name": "Greenstone Amulet",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"When worn, this amulet sheds bright light in a 10-foot radius and dim light for an additional 10 feet.",
	        	"This amulet confers the benefits of a {@spell mind blank} spell upon its wearer. Additionally, the wearer can't be communicated with telepathically."
	        ]
	    },
	    {
	        "name": "Hands of the Healing Spirit",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "ability": {
	        	"wis": 2
	        },
	        "entries": [
	        	"While wearing this amulet you gain the following benefits:",
	        	{
	        		"type":"list",
	        		"items":[
	        			"You can sense the presence of magic within 10 feet of you, as if you had cast the {@spell detect magic} spell.",
	        			"You gain advantage on saving throws made to resist effects that would poison or disease you.",
	        			"Your Wisdom score increases by 2, to a maximum of 22.",
	        			"You no longer show physical signs of aging.",
	        			"The result of any rolls made to restore hit points to you are doubled."
	        		]
	        	},
	        	"Additionally you may cast the following spells from the amulet: {@spell heal}, {@spell mass cure wounds}, {@spell mass healing word}. Each of these spells can be cast once, using Wisdom as your spellcasting ability. They can't be cast again until dawn of the next day."
	        ],
	        "attachedSpells": [
	        	"heal",
	        	"mass cure wounds",
	        	"mass healing word"
	        ]
	    },
	    {
	        "name": "Hardwater Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "curse":true,
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While wearing this amulet, you may use an action to  touch a section of water, causing it to harden to a consistency of granite. You can harden the water in any shape that fits in a cube up to 10 feet on each side. If a creature is in the water when it transforms, it must make a DC 14 Dexterity saving throw. On a successful save, a creature is shunted safely to the nearest unoccupied space. On a failed save, a creature becomes {@condition restrained} by the hardened water. A creature may use an action to attempt to break the hardened water by succeeding on a DC 20 Strength check or by dealing damage to it. The hardened water has AC 15 and 25 hit points, and it is immune to poison and psychic damage.",
	        	"Water hardened in this way lasts 1 minute.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"While wearing this amulet, you have disadvantage on initiative rolls."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Holy Turning",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This holy symbol is imbued with an effect that repels undead, as if it were affected by the antipathy version of the {@spell antipathy/sympathy} spell ({@dc 13}). This effect is considered equivalent to a {@classFeature turn undead|Cleric||2||cleric's turn undead} for the purposes of monsters that may have immunity or resistance to such an effect."
	        ]
	    },
	    {
	        "name": "Periapt of Filth",
	        "source": "EM5E",
	        "alias":[
	        	"Kara-Turan Amulet of Health"
	        ],
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This item appears to be a {@item periapt of health|dmg} to anyone who tries to {@spell identify} it, but it does not confer that item's properties.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. While it is on your person, you have disadvantage on saving throws made to resist disease."
	        		]
	        	},
	        	"{@note This item is indexed as a variant in Encyclopedia Magica under \"Amulet of Health\".}"
	        ]
	    },
	    {
	        "name": "Amulet of the Hero",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"You can speak this item's command word as an action, causing an 8th-level {@class warrior sidekick|tce|warrior} to appear in an unoccupied space within 30 feet of you. This warrior obeys your commands to the best of its abilities, and remains until it dies. The warrior can not harm themself nor perform an act that would spell their doom. All damage the warrior takes is permanent and may not be healed in any way short of a {@spell wish} spell.",
	        	"The amulet can generate three different warriors in this way, though a new one may not be generated while one is already present.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. Any warriors generated by the amulet are hopelessly incapable and automatically fail any attack roll, saving throw, or ability check they attempt. The warrior also immediately falls off any mount they attempt to ride."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Hunting",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you have advantage on Wisdom ({@skill Survival}) checks made to forage. Additionally, you double your Wisdom modifier when considering the units of food foraged.",
	        	"{@note See the {@book wilderness kit|screenwildernesskit|0|Foraging|0} for rules regarding foraging.}"
	        ]
	    },
	    {
	        "name": "Amulet of Immunity to Charm",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you automatically succeed saving throws made to resist effects that would {@condition charm} you, unless produced by a {@spell wish} spell."
	        ]
	    },
	    {
	        "name": "Amulet of Inescapable Location",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This item appears to be an {@item amulet of proof against detection and location|dmg} to anyone who tries to {@spell identify} it, but it does not confer that item's properties.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. While it is on your person, you are more susceptible to divination magic. You have disadvantage on rolls made to resist or otherwise impair the effects of magic used to divine anything about your person."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Insect Repellency",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"Tiny insects such as fleas or mosquitos can not approach the amulet or its wearer."
	        ]
	    },
	    {
	        "name": "Kaleen's Undead Stone",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":"by a cleric",
	        "reqAttuneTags":[
	        	{
	        		"class":"cleric"
	        	}	
	        ],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"When you use your {@classFeature channel divinity (1/rest)|cleric||2||channel divinity} class feature to turn undead, you can immediately cast the {@spell antilife shell} spell. This version of the spell only affects undead, but all other details remain the same."
	        ],
	        "attachedSpells": [
	        	"antilife shell"
	        ]
	    },
	    {
	        "name": "Amulet of Lathander",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"If you start your turn while at 0 hit points, you regain {@dice 1d6} hit points. If you are an avid worshipper of a deity of the life domain such as {@deity Lathander}, then you instead are healed as if you had been affected by the {@spell heal} spell.",
	        	"This property functions three times per day.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"If you are of an evil or neutral alignment and you put the amulet on, you suffer 10 ({@dice 3d6}) points of irreducible radiant damage at the start of each of your turns until you take the amulet off, immediately causing you to become unattuned."
	        		]
	        	}
	        ],
	        "attachedSpells": [
	        	"heal"
	        ]
	    },
	    {
	        "name": "Amulet of Leadership",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, soldiers and men-at-arms that would be otherwise indifferent to you now regard you as a friend.",
	        	"You have advantage on checks made to carouse with soldiers or men-at-arms.",
	        	"If you take the amulet off for any reason, the disposition of the soldiers returns to normal."
	        ]
	    },
	    {
	        "name": "Amulet of Life Protection",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you automatically succeed on saving throws made to resist effects that would dominate you or possess you, such as those provoked by the {@spell dominate person}, or {@spell magic jar} spells.",
	        	"If you die while wearing the amulet, your soul enters it, unless it already houses a soul. You remain in the amulet for 7 days, after which you safely depart for the afterlife. As long as your soul is in the amulet, you can telepathically communicate with any creature wearing it. A wearer can't prevent this telepathic communication."
	        ]
	    },
	    {
	        "name": "Amulet of Metaspell Influence",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune": "by a sorcerer",
	        "reqAttuneTags":[
	        	{
	        		"class":"sorcerer"
	        	}
	        ],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You gain the ability to use two {@classFeature metamagic|sorcerer||3} options on a single spell.",
	        	"You can use this property twice, regaining all expended uses daily at dawn."
	        ]
	    },
	    {
	        "name": "Amulet of Neutrality",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"While wearing this amulet, you appear to all divination magic to be of neutral alignment."
	        ]
	    },
	    {
	        "name": "Palm Sign",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet glows when there is an efreeti within 120 feet of it.",
	        	"While wearing the amulet, you have resistance to fire damage.",
	        	"You can use an action to cast the {@spell magic missile} spell at 6th level, targeting only efreeti. Any efreeti damaged by this spell must succeed a {@dc 16} Wisdom saving throw or be {@condition frightened} of you. Once used, this ability can't be used again until dawn.",
	        	"An efreeti frightened in this way must spend its turns trying to move as far away from you as it can. It also can't take reactions. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the efreeti can use the {@action Dodge} action."
	        ],
	        "attachedSpells": [
	        	"magic missile"
	        ]
	    },
	    {
	        "name": "Amulet of the Papyrus Scepter",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, your Constitution score is 19. This property has no effect if your Constitution score is already 19 or higher without it.",
	        	"While wearing this amulet, you can choose to retrograde your aging process. You no longer physically age, and instead your age is reduced by the amount of time that passes while wearing the amulet. After {@dice 1d6 + 4} years of aging in retrograde, the amulet is destroyed, and you begin to age normally.",
	        	{
	        		"type":"inset",
	        		"entries": [
	        			"Variations of this amulet are said to exist that improve other physical ability scores such as Dexterity or Strength, replacing the Constitution improvement."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Perpetual Youth",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet glows with a faint, blue light. While wearing it, you have temporary immunity to the effects of both natural and magical aging. The amulet can absorb {@dice 5d6} years of aging, after which it loses all of its magical properties and becomes non-magical."
	        ]
	    },
	    {
	        "name": "Amulet of Perpetual Youth and Inexperience",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This item appears to be an {@item amulet of perpetual youth and experience|EM5E} to anyone who tries to {@spell identify} it, but it does not confer that item's properties.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. Every day at dawn, the wearer must succeed a DC 17 Charisma saving throw or have their proficiency bonus reduced by 1. This reduction lasts until the creature is targeted by a {@spell remove curse} spell or similar magic, unless this amulet reduces your proficiency bonus to 0, in which case nothing short of a {@spell wish} spell can restore your proficiency bonus. This reduction can not reduce your proficiency bonus below 0."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Power",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":"by a spellcaster",
	        "reqAttuneTags": [
	        		{
	        			"spellcasting": true
	        		}
	        	],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet confers no benefit nor can its properties be used until you have been attuned to it for 30 consecutive days. Once a user goes through this process, they never need to again.",
	        	"While wearing this amulet, you gain the following benefits:",
	        	{
	        		"type":"list",
	        		"items":[
	        			"You gain a +1 bonus to spell attack rolls and to the saving throw DCs of your spells.",
	        			"Spells that you cast with a range of at least 30 feet have their range increased by an additional 30 feet.",
	        			"When you roll a 1 on a damage die for a spell that you cast, you can reroll the die and must use the new roll, even if the new roll is a 1."
	        		]
	        	},
	        	"When you cast a spell of 7th level or lower while wearing this amulet, you can forgo expending a spell slot. Once you use this property, you can't use it again until the next dawn."
	        ],
	        "bonusSpellAttack": "+1",
	        "bonusSpellSaveDc": "+1"
	    },
	    {
	        "name": "Kalna-Kaa's Amulet of Protection",
	        "source": "EM5E",
	        "alias":[
	        	"Amulet of Protection"
	        ],
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, it provides the following benefits:",
	        	{
	        		"type":"list",
	        		"items":[
	        			"You have a +1 bonus to AC and saving throws while wearing this amulet.",
	        			"If you are a lycanthrope, you become immune to effects from herbs and concoctions which are traditionally detrimental to lycanthropes, such as wolfsbane."
	        		]
	        	}
	        ],
	        "bonusAc":"+1",
	        "bonusSavingThrow": "+1"
	    },
	    {
	        "name": "Amulet of Protection from Alignment Change",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you are protected from magical effects, including curses, that would change your alignment. This property fails to protect from effects created by artifacts."
	        ]
	    },
	    {
	        "name": "Amulet of Protection from Good",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune": "by a creature of evil alignment",
	        "reqAttuneTags":[
	        	{
	        		"alignment":[
	        			"E"
	        		]
	        	}
	        ],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You gain a +1 bonus to AC while wearing this amulet. Additionally, you gain a +1 bonus to attack rolls against good aligned creatures."
	        ],
	        "bonusAc":"+1"
	    },
	    {
	        "name": "Amulet of Protection from Sleep",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you can not sleep by any means, magical or otherwise; however, this amulet does not protect you from harmful effects that come from not sleeping."
	        ]
	    },
	    {
	        "name": "Amulet of Psionic Interference (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Amulet of Psionic Reflection (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Amulet of Recall",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"It takes one minute to activate this item, upon which you and every willing creature touching you teleports to a location specific to the amulet. If you are on a different plane than the designated location, the teleportation fails.",
	        	"The destination of this teleportation is the most recent place where the item was left stationary and unworn for 30 consecutive days."
	        ]
	    },
	    {
	        "name": "Cosette's Shakti",
	        "source": "EM5E",
	        "alias":[
	        	"Shakti Amulet"
	        ],
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"When you use an action to speak this amulet's command word, it surrounds you in magical {@item plate armor|phb}, and arms you with up to two magical {@item shortsword|phb|shortswords}. When you roll a 20 with one of these shortswords, the target takes an extra 7 lightning damage.",
	        	"If you are already donning armor or if your hands are occupied when you speak the command word, it does nothing."
	        ]
	    },
	    {
	        "name": "Shell of Protection from Sharks",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While worn, this amulet projects an imperceptible magic barrier in a 10-foot-radius around you. The barrier prevents sharks from passing or reaching through. If you attack a shark while wearing the amulet, this property is immediately disabled for 1 hour."
	        ]
	    },
	    {
	        "name": "Shield Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "recharge":"dawn",
	        "charges":24,
			"weight": 1,
	        "entries": [
	        	"This amulet has 24 charges. When you take damage from a weapon attack while wearing the amulet, you can use a reaction to expend 1 or more charges, reducing the damage taken by an equal amount.",
	        	"The amulet regains {@dice 2d12} expended charges daily at dawn."
	        ]
	    },
	    {
	        "name": "Amulet of Sleeplessness",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This amulet appears to be an {@item amulet of protection from sleep|em5e} to anyone who tries to {@spell identify} it, and it confers that item's property while on your person.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries": [
	        			"This item is cursed. Once you put it on, you can't willingly remove it until you are targeted by the {@spell remove curse} spell or similar magic."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Phelthong's Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet has 7 charges. It regains {@dice 1d6+1} expended charges daily at dawn. If the amulet is in sunlight for more than one hour, it does not regain any charges on the following day at dawn. If it spends one hour in sunlight while at 0 charges, the amulet disintegrates.",
	        	{
	        		"type":"entries",
	        		"name":"Spells",
	        		"entries":[
	        			"While wearing the amulet, you can use an action to expend some of its charges to cast one of the following spells: {@spell dimension door} (3 charges) or {@spell fog cloud} (3rd level; 4 charges).",
	        			"When you cast one of these spells from the amulet, any nonmagical fires within 30 feet of you are immediately extinguished."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Amulet of Spinecastle",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"As an action, you can cause the amulet to emit a magical blast in a 30-foot-radius. Any humanoid in the area that lacks the spellcasting trait must succeed a DC 12 Wisdom saving throw or become {@condition frightened} for 1 minute. While {@condition frightened}, a creature has disadvantage on saving throws against spells. A {@condition frightened} creature may repeat the saving throw at the end of each of its turns, ending the effect on a success.",
	        	"This amulet can be used once, regaining its use daily at dawn."
	        ]
	    },
	    {
	        "name": "Amulet of the Spirit",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing the amulet, you are immune to effects that would possess you or transfer your soul.",
	        	"If you die while wearing the amulet, your soul enters it, unless it already houses a soul. As long as your soul is in the amulet, you can telepathically communicate with any creature wearing it. A wearer can't prevent this telepathic communication.",
	        	"A soul can be removed from the amulet by casting the {@spell dispel evil and good} spell or the {@spell banishment} spell on the amulet."
	        ]
	    },
	    {
	        "name": "Thet of Ptah",
	        "alias":[
	        	"Tjt of Ptah",
	        	"Tyet of Ptah"
	        ],
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you are surrounded by an {@spell antimagic field} in a 10-foot-radius sphere. Your spells and magical effects are unimpeded by the sphere."
	        ]
	    },
	    {
	        "name": "Thet of Ether",
	        "alias":[
	        	"Tjt of Ether",
	        	"Tyet of Ether"
	        ],
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you can cast the {@spell etherealness} spell as an action. Once this action is used, it can't be used again until the next dawn."
	        ]
	    },
	    {
	        "name": "Amulet of Timekeeping",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you can use an action to determine whether it is morning, afternoon, evening, or nighttime outside. This property functions only on the Material Plane."
	        ]
	    },
	    {
	        "name": "Amulet of Transformation",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":"by a druid",
	        "reqAttuneTags":[
	        	{
	        		"class":"druid"
	        	}
	        ],
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this amulet, you gain an additional use of your {@classFeature wild shape|Druid||2} feature, which you can only use to assume the form of a specific beast determined by the amulet."
	        ]
	    },
	    {
	        "name": "Two Fingers Amulet",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"As an action, you can speak the amulet's command word, causing a sturdy wooden ladder to spring forth from the amulet up to 100 feet long. The ladder can hold up to 1,000 pounds. If the ladder is destroyed, it immediately converts back into an amulet. Once used, this action can't be used again until the next dawn."
	        ]
	    },
	    {
	        "name": "Amulet of Undersea Friendship",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune": "by a water breathing creature",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing the amulet, you have advantage on Charisma checks directed towards other water breathing creatures."
	        ]
	    },
	    {
	        "name": "Amulet of Vadarin (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Vulture Amulet",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"When this amulet is placed on a dead body for one full day, the deceased can never be turned into an undead creature. Once used in this way, a week must pass before the amulet can be used again."
	        ]
	    },
	    {
	        "name": "Amulet of Weakening",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This amulet constantly emits a 30-foot-radius magical aura that is more powerful near the amulet, and gradually gets weaker further away from the amulet. While a creature (who is not attuned to the amulet) is in the aura, it takes a -1 penalty to their Strength score for every 10 feet from the aura's edge. In other words, a creature within 10 feet of the amulet has a -3 to their Strength score, while a creature 30 feet away has only a -1 penalty.",
	        	"Attuning to this amulet takes 8 hours of meditation. At the end of every hour, a creature must succeed a DC 20 Constitution saving throw or gain one level of exhaustion."
	        ]
	    },
	    {
	        "name": "Aerial Anchor",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"This is a 3-inch-long, miniature anchor can be fitted with a mundane string or cable. As an action, you can speak the anchor's command word to cause it to secure itself, becoming magically fixed in place. The anchor stays secure until another command word is used to release it, as an action. Until it is released, the anchor doesn't move, even if it is defying gravity. The anchor and its thread can hold up to 3,000 pounds of weight. More weight causes the anchor to deactivate and fall. A creature can use an action to make a DC 25 Strength check, moving the fixed anchor up to 10 feet on a success."
	        ]
	    },
	    {
	        "name": "Fishing Anchor",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 10000,
	        "entries": [
	        	"While submerged in water, this anchor has a high chance of attracting monsters of the sea. When such a creature encounters the anchor, it attempts to swallow the anchor."
	        ]
	    },
	    {
	        "name": "Manchor",
	        "alias":[
	        	"Man Anchor"
	        ],
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 10000,
	        "entries": [
	        	"As an action, you can speak this anchor's command word to cause it to animate. It has a swimming speed of 50 feet and disintegrates upon dropping to 0 hit points, but otherwise uses the {@creature animated object (large)|phb} statblock. The anchor follows instructions of the captain of a vessel."
	        ]
	    },
	    {
	        "name": "Seafaring Anchor",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 10000,
	        "entries": [
	        	"As an action, you can speak this anchor's command word, causing it to magically lengthen or shorten its cable either to a named length or until the anchor reaches the seafloor. The maximum length of the cable is 5,000 feet."
	        ]
	    },
	    {
	        "name": "Anchor of Weight",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This is a 3-inch-long, miniature anchor can be fitted with a mundane string or cable. As an action, you can speak the anchor's command word to cause it to secure itself, becoming magically fixed in place. The anchor stays secure until another command word is used to release it, as an action. Until it is released, the anchor doesn't move, even if it is defying gravity. The anchor and its thread can hold up to 3,000 pounds of weight. More weight causes the anchor to deactivate and fall. A creature can use an action to make a DC 25 Strength check, moving the fixed anchor up to 10 feet on a success.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"This item is cursed. When used, there is a {@chance 50} that the anchor does not secure itself and instead gains a weight of 3,000 pounds, dragging the user down until the anchor reaches the ground at which point it immediately vanishes."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Ankh of Life (WIP)",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 3,
	        "entries": [
	        	"This powerful symbol of divinity was lost millenia ago in the Orcgate Wars. It was the holy symbol of the manifestation of Re. It is a worn and dirty rod of birchwood, without any ornamentation, 1-foot-long, in the shape of an ankh.",
	        	{
	        		"type":"entries",
	        		"name":"Random Properties",
	        		"entries":[
	        			"The {@i Ankh of Life} has the following randomly determined properties:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"2 {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial properties}"
	        				]
	        			}
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Nithian Ankh",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 2,
			"entries":[
				"Multiple variations of this item exist, as listed below:",
				{
					"type":"list",
					"items": [
						"{@item Nithian Ankh (Ixion)|ZRC}",
						"{@item Nithian Ankh (Kagyar)|ZRC}",
						"{@item Nithian Ankh (Pflarr)|ZRC}",
						"{@item Nithian Ankh (Rathanos)|ZRC}",
						"{@item Nithian Ankh (Valerias)|ZRC}"
					]
				}	
			]
	    },
	    {
	        "name": "Nithian Ankh (Ixion)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While grasped, this ankh sheds bright light in a 10-foot-radius and dim light for an additional 10 feet.",
	        	"You can use your action to cast the {@spell Aganazzar's scorcher|xge} spell (DC 15). The level of the spell being cast is equal to twice your proficiency bonus, up to 9.",
	        	"You can use this item once, after which the item immediately loses its magical properties and becomes a mundane ankh."
	        ]
	    },
	    {
	        "name": "Nithian Ankh (Kagyar)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While grasped, this ankh sheds bright light in a 10-foot-radius and dim light for an additional 10 feet.",
	        	"As a bonus action you can activate the ankh. For the next 10 minutes, you gain a burrow speed equal to your walking speed and can burrow through nonmagical, unworked earth and stone. While doing so you don't disturb the material you move through.",
	        	"You can use this item once, after which the item immediately loses its magical properties and becomes a mundane ankh."
	        ]
	    },
	    {
	        "name": "Nithian Ankh (Pflarr)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While grasped, this ankh sheds bright light in a 10-foot-radius and dim light for an additional 10 feet.",
	        	"As an action, you can recover a number of expended spell slots equivalent to half of your level in any spellcasting class (rounded up).",
	        	"You can use this item once, after which the item immediately loses its magical properties and becomes a mundane ankh."
	        ]
	    },
	    {
	        "name": "Nithian Ankh (Rathanos)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While grasped, this ankh sheds bright light in a 10-foot-radius and dim light for an additional 10 feet.",
	        	"When you use your action and present the ankh, a {@creature fire elemental} is summoned as if you had cast the {@spell conjure elemental} spell.",
	        	"You can use this item once, after which the item immediately loses its magical properties and becomes a mundane ankh."
	        ]
	    },
	    {
	        "name": "Nithian Ankh (Valerias)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While grasped, this ankh sheds bright light in a 10-foot-radius and dim light for an additional 10 feet.",
	        	"As an action you can press this ankh to a nonmagical weapon. That weapon immediately bestows a +1 bonus to attack and damage rolls made with it, as if it were a {@item +1 weapon|dmg}",
	        	"You can use this item once, after which the item immediately loses its magical properties and becomes a mundane ankh."
	        ]
	    },
	    {
	        "name": "Ankh of Power",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune": "by a creature that worships a god of the sun",
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"While on your person, the ankh sheds bright light in a 20-foot radius and dim light for an additional 20 feet.",
	        	"Any dice rolled to regain hit points as a result of your spellcasting are doubled.",
	        	"As an action, you may utter the command word to cast the {@spell sunbeam} spell (DC 15). This property can be used three times, regaining expended uses daily at dawn."
	        ],
	        "attachedSpells":[
	        	"sunbeam"
	        ]
	    },
	    {
	        "name": "Equus Anklet",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You can speak the anklet's command word as an action, causing it to magically assume the form of a beast of burden decided upon by the DM.",
	        	"The beast of burden remains until it dies, whereupon it immediately reverts to anklet form and loses its magical properties, becoming a mundane anklet."
	        ]
	    },
	    {
	        "name": "Anklet of Growth (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Anklet of Hobbling",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 2,
	        "entries": [
	        	"A creature wearing this anklet uses 3 feet of movement for each foot moved."
	        ]
	    },
	    {
	        "name": "Anklet of Levitation",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"You can speak the command word of this anklet as an action, causing it to steadily rise as if the {@spell levitate} spell had been cast upon it, up to a maximum height of 60 feet. If a creature is wearing it then it also rises as if affected by the spell; however, if the creature is wearing only one anklet then they are hoisted by one leg. While hoisted in this way, the creature is {@condition restrained} until they can free themself from the anklet."
	        ]
	    },
	    {
	        "name": "Anklet of Sinking",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "curse":true,
			"weight": 1,
	        "entries": [
	        	"This anklet appears to be an {@item anklet of walking|em5e} to anyone who tries to {@spell identify} it, and it confers that item's properties while on your person.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"This item is cursed. When used to walk on acid or on water more than 30 feet deep, the anklet stops functioning and becomes as heavy as a 100-pound weight (per anklet). When this occurs, the anklet also {@spell dispel magic||dispels} {@spell water walk} effects caused by spells. The anklet sinks until removed."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Anklet of Sure Footing",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this anklet, you ignore difficult terrain caused by harsh conditions on a seafaring ship or boat. Additionally, while on such a vessel you gain a climbing speed equal to your walking speed."
	        ]
	    },
	    {
	        "name": "Anklet of Walking",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
			"weight": 1,
	        "entries": [
	        	"While wearing this anklet, you can stand on and move across any liquid surface as if it were solid ground."
	        ]
	    },
	    {
	        "name": "Antennae of Triangulation",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 300,
	        "entries": [
	        	"This large, complex contraption is used in combination with the helmet of liaison. While wearing the helmet, you gain a complete mental picture of the surrounding environment within a 6-mile-radius, including fine details. This mental picture is unimpeded by normal conditions, such as total cover or darkness.",
	        	"A creature who dons the helmet of liaison immediately becomes attuned to the antennae, until they remove it."
	        ]
	    },
	    {
	        "name": "High Anvil of the Dwarves",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 175,
	        "entries": [
	        	"You must be proficient with {@item smith's tools|phb} to use this anvil.",
	        	"While using this anvil to craft metal objects, you add twice your proficiency bonus for any ability check that uses smith's tools, unless you already benefit from a feature that doubles your proficiency bonus. Additionally, any item crafted by you takes half as long to craft and is of remarkable quality."
	        ]
	    },
	    {
	        "name": "Iron Anvil of the Armies",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 500,
	        "entries": [
	        	"You must be proficient with {@item smith's tools|phb} to use this anvil.",
	        	"While using this anvil to craft metal objects, you work at six times the speed. Additionally, any broken nonmagical weaponry can be repaired using an action.",
	        	"The anvil is magically demanding, and after a day of work, you must succeed on a DC 10 Constitution saving throw or gain one point of {@condition exhaustion|phb}. The DC for this saving throw increases by 1 for every consecutive day worked."
	        ]
	    },
	    {
	        "name": "Anvil of the Lortmil Mountains",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "wondrous":true,
			"weight": 175,
	        "entries": [
	        	"Only a dwarf proficient with {@item smith's tools|phb} can use this anvil.",
	        	"While using this anvil to craft metal objects, you work half as fast; however, the crafted object has a chance to be significantly more valuable than normal. Once during the crafting process, you can attempt a DC 25 Strength ({@item smith's tools|phb}) check. On a success, the crafted item is 100 times the normal cost. There is no penalty for failure."
	        ]
	    },
	    {
	        "name": "The Apparatus",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"{@i The Apparatus} is a huge object with immunity to lightning damage in addition to the normal poison and psychic damage.",
	        	"This massive contraption contains two adjacent glass chambers that can each house a medium-sized humanoid. The glass chambers are joined by a series of thin glass tubes, rods, wires, and plates, from which harmless lightning infrequently apparates.",
	        	"When this magical object is struck by something that would deal lightning damage, it is instead energized by the strike. After 12 consecutive, separate instances of lightning damage within the span of 3 hours, {@i The Apparatus} activates, causing one of the following effects depending on the circumstance:",
	        	{
	        		"type":"entries",
	        		"name":"Transpossession",
	        		"entries":[
	        			"If two creatures with an Intelligence score of 6 or higher are in the two chambers at the time of activation, their minds exchange. The mental statistics of the creatures are exchanged, though the body retains its physical statistics. A creature who has been transpossessed loses access to any class features for as long as their mind inhabits a foreign body. Immediately after this process, the participating creatures fall unconscious for {@dice 1d3} hours."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Personality Split",
	        		"entries":[
	        			"This effect requires the {@i Rod of Rastinon}, another item of legend. The rod can be placed somewhere in the contraption, which allows a creature to split their personality into two creatures, each retaining a separate facet of the original creature's personality. This entails a creature standing alone in one of the glass chambers while the other is empty. When {@i The Apparatus} activates, another creature who is physically identical to the original is produced in the empty glass chamber. Typically, one creature retains only neutral or good characteristics, and the other retains all evil characteristics."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Personality Bind",
	        		"entries":[
	        			"If two creatures with an Intelligence score of 6 or higher are in the two chambers at the time of activation, and the {@i Rod of Rastinon} is in place, then the two creatures have their personalities bound to one body. The stronger body harbors the minds of the two creatures, and the weaker body becomes an empty shell that is {@condition incapacitated} until it somehow regains its mental faculties."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Apparatus of Spikey Owns",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
			"weight": 500,
	        "entries": [
	        	"This item resembles an {@item Apparatus of Kwalish} except that, when activated, it becomes a 10-piece one-man-band renowned for its cacophony. Anyone within 120 feet that can hear the it must succeed a DC 12 Wisdom saving throw or do everything within their power to stop the operator, including harming those in their way.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"As soon as a creature attempts to operate the vehicle, they are immediately {@condition charmed} by it. While {@condition charmed} in this way, a creature must continue to operate the apparatus, not even stopping to eat."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Apple of Bragi",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 0.5,
	        "entries": [
        		"Upon consuming this magical apple, you are affected as if a {@spell greater restoration} spell had been cast on you."
	        ]
	    },
	    {
	        "name": "Apple of Chaos",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "minor",
	        "wondrous":true,
			"weight": 0.5,
	        "entries": [
	        	"This apple can be thrown up to 60 feet accurately. Upon landing, the apple disappears and a glowing, illusory apple takes its place for 1 minute. The illusory apple sheds bright light in a 20-foot-radius and dim light for an additional 20 feet. When a creature that can see the apple starts their turn within 40 feet of it, the creature must succeed on a DC 15 Wisdom saving throw or be effected by the {@spell confusion} spell. A creature can't avert their eyes from this magical effect."
	        ]
	    },
	    {
	        "name": "Apron of Comfort",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"This apron never gets dirty.",
	        	"While wearing this apron, you don't suffer any ill effects from extreme heat (see chapter 5 of the Dungeon Master's Guide. Additionally, you have advantage on Constitution saving throws made to resist {@condition exhaustion} from overexertion."
	        ]
	    },
	    {
	        "name": "Arabel's Huggable Bear",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"From dusk to dawn, this stuffed bear radiates a sphere of protection. Creatures within 5 feet of the bear are immune to divination magic. They can't be targeted by such magic or perceived through magical scrying sensors, and are immune to the {@spell dream} spell or other similar magics.",
	        	"Additionally, any creature that successfully completes a long rest while within the sphere the whole time regains twice the normal amount of hit dice."
	        ]
	    },
	    {
	        "name": "Arm of Doom",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"Upon touching this arm, it immediately grafts itself to you somewhere on your body. The creature is also immediately attuned to the arm, if the creature is already attuned to their maximum number of attuned magic items, they must choose one which becomes unattuned simultaneously.",
	        	"While the arm is grafted to you, you gain an additional action on each of your turns that can only be used to make one melee weapon attack with the claw. It uses your bonus to hit and deals 13 ({@dice 2d12}) slashing damage. The arm can attack even if you suffer from an effect that would {@condition incapacitated|phb|incapacitate} you. Also on a hit, one magic item the creature is carrying (determined randomly) that isn't an artifact has its magical properties suppressed until the end of your next turn.",
	        	"After taking 50 lives the arm tears free, dealing 14 ({@dice 4d6}) irreducible piercing damage to you and forcing a roll on the {@table Massive Damage; System Shock|dmg|system shock table}, causing you to become unattuned to it."
	        ]
	    },
	    {
	        "name": "Silver Arm of Ergoth (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Arm of Valor (WIP)",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"This lead plated, armored, arm is a five-piece set consisting of the gauntlet, vambrace, couter, rerebrace, and the pauldron. You can attune to any number of the arm's pieces as if they were a single magic item. Each section you don confers different properties to you:",
	        	{
	        		"type":"entries",
	        		"name":"Gauntlet",
	        		"entries":[
	        			"While donned, this segment confers the following benefits to you:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"You are advantage on saving throws against spells that would {@condition charmed|phb|charm} you, {@condition paralyzed|phb|paralyze} you, or render you {@condition unconscious}.",
	        					"You can use the gauntlet as a melee weapon that deals {@dice 1d4} bludgeoning damage and is considered an unarmed attack.",
	        					"As an action you can use the gauntlet to perform a crushing blow, targeting a creature within reach. Make a melee attack with the gauntlet, dealing {@dice 3d6} bludgeoning damage. There is a {@chance 30} chance that any armor the creature is wearing is immediately destroyed."
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Vambrace",
	        		"entries":[
	        			"While donned, this segment confers the following benefits to you:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"When you fall, you descend 60 feet per round and take no damage from falling.",
	        					"You can cast the {@spell jump} spell as a bonus action at will, but can target only yourself when you do so.",
	        					"You have a +1 bonus to attack and damage rolls made with melee weapons.",
	        					"You are hidden from divination magic and can't be targeted by such magic or perceived through magical scrying sensors.",
	        					"You can see {@condition invisible} creatures and objects within 30 feet of you."
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Couter",
	        		"entries":[
	        			"While donned, this segment confers the following benefits to you:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"You can cast the {@spell dimension door} spell as an action at will.",
	        					"You can breathe normally underwater.",
	        					"You are constantly under the effects of the {@spell detect magic} spell."
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Rerebrace",
	        		"entries":[
	        			"While donned, this segment confers the following benefits to you:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"You have a +2 bonus to attack and damage rolls made with melee weapons that are not already {@item +2 Weapon|dmg|+2 or higher}, and they are considered magical for the purpose of overcoming resistances. This benefit is cumulative with the vambrace bonus.",
	        					"You can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight."
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Pauldron",
	        		"entries":[
	        			"While donned, this segment confers the following benefits to you:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"You gain a +2 bonus to AC.",
	        					"You have advantage on saving throws against all enchantment magic.",
	        					"As an action, you can attack one creature you can see within 60 feet of you. The pauldron emits a spectral blast and makes its attack roll with a +7 bonus. On a hit, the target takes {@dice 2d10} force damage and is pushed 5 feet away from you."
	        				]
	        			}
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Comfort of Sleep",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "minor",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing these arm wrappings, you sleep soundly and comfortably."
	        ]
	    },
	    {
	        "name": "Armband of Death",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "curse": true,
	        "wondrous":true,
	        "entries": [
	        	"This armband appears to be an {@item armband of healing|em5e} to anyone who tries to {@spell identify} it, and it confers that item's property while on your person.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"When a creature puts on the armband, the snakes on its insignia animate and bite the wearer at the start of each of the creature's turns. The snakes have a +7 to hit and have advantage on their attack. On a hit, the creature takes one point of piercing damage, and must make a DC 13 Constitution saving throw or drop to 0 hit points. If the creature fails by 5 or more, they immediately die. The armband can't be unlocked until it is destroyed or until a {@spell remove curse} spell is cast on it."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Armband of Healing",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "charges": 3,
	        "recharge":"dawn",
	        "reqAttune": "by a bard, cleric, or druid",
	        "reqAttuneTags":[
	        	{
	        		"class": "bard"
	        	},
	        	{
	        		"class": "cleric"
	        	},
	        	{
	        		"class": "druid"
	        	}
	        ],
	        "wondrous":true,
	        "entries": [
	        	"This armband bears an insignia of two snakes entwined about a staff.",
	        	"The armband has 3 charges, regaining {@dice 1d3} charges daily at dawn. When you roll to restore a creature's hit points, you can expend a charge to heal the maximum amount, instead of rolling."
	        ]
	    },
	    {
	        "name": "Armband of Salutation",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "curse": true,
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this armband, you must spend your first round of any combat saluting the enemy, doing nothing else on your turn. There is a {@chance 50} that any hostile humanoid is so surprised that they also do not act on their turn.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"Once locked on the arm of a creature, the armband can not unlock by any means short of a {@spell remove curse} spell."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Armlet of Snake Changing",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this pair of armlets, you can use an action to {@spell polymorph} yourself into the form of any snake."
	        ]
	    },
	    {
	        "name": "Armlet of Strength",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "charges":3,
	        "recharge":"dawn",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"This armlet has 3 charges, regaining {@dice 1d3} expended charges daily at dawn. While wearing it, you can use a bonus action to expend a charge, causing your Strength score to become 20 until the end of your next turn. The armlet has no effect if your Strength is already 20 or higher."
	        ]
	    },
	    {
	        "name": "Trueheart's Warding Armband (WIP)",
	        "source": "EM5E",
	        "rarity": "",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Armlet of Variable Strength",
	        "source": "EM5E",
	        "rarity": "uncommon",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "curse":true,
	        "entries": [
	        	"This armlet appears to be a {@item armlet of strength|em5e} to anyone who tries to {@spell identify} it.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"When a creature attunes to this armlet, their strength score immediately drops to 3. At the start of each of their turns their strength increases by 1 until it reaches 20, whereupon it is dropped once more to 3. This cycle continues until the creature manages to unattune to the armlet."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Trueheart's Warding Armband",
	        "source": "EM5E",
	        "rarity": "artifact",
	        "tier": "major",
	        "reqAttune":true,
	        "wondrous":true,
	        "entries": [
	        	"While wearing this bronze armband, you gain the following benefits:",
	        	{
	        		"type":"list",
	        		"items":[
	        			"You gain a +2 bonus to AC and saving throws.",
	        			"You have immunity to damage from non-magical attacks.",
	        			"You do not age.",
	        			"The armband has 3 charges. You can use an action to expend a charge and cast the {@spell heal} spell on yourself. You regain all expended charges daily at dawn."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Abbathor's Leather Armor",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "baseItem":"leather armor|phb",
	        "type":"LA",
	        "bonusAc": "+2",
	        "weight": 10,
	        "ac":11,
	        "reqAttune":true,
	        "armor": true,
	        "entries": [
	        	"You have a +2 bonus to AC while wearing this armor.",
	        	"While you're wearing this armor, you can cast the {@spell blindness/deafness} spell (save DC 15) as an action. Once used, this property can't be used again until the next dawn.",
	        	"The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials."
	        ]
	    },
	    {
	        "name": "Armor of Absorption",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "type":"GV",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	"If you fail a saving throw against a necromancy spell or a harmful effect originating from an undead creature while you're wearing this armor, you can use your reaction to turn the failed saving throw into a successful one. Every time you use this reaction, the armor takes a permanent and cumulative -1 penalty to the AC it offers. When the armor is reduced to an AC of 10, it disintegrates and is destroyed.",
	        	{
	        		"type":"entries",
	        		"name":"Base items",
	        		"entries":[
	        			"This item variant can be applied to the following base items:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"{@item Breastplate|phb}",
	        					"{@item Chain Mail|phb}",
	        					"{@item Chain Shirt|phb}",
	        					"{@item Half Plate Armor|phb}",
	        					"{@item Hide Armor|phb}",
	        					"{@item Leather Armor|phb}",
	        					"{@item Padded Armor|phb}",
	        					"{@item Plate Armor|phb}",
	        					"{@item Ring Mail|phb}",
	        					"{@item Scale Mail|phb}",
	        					"{@item Splint Armor|phb}",
	        					"{@item Studded Leather Armor|phb}"
	        				]
	        			}
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Armor of Acidic Secretion",
	        "source": "EM5E",
	        "rarity": "rare",
	        "curse":true,
	        "tier": "major",
	        "type":"GV",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	"This armor appears to be some other magical armor to anyone who tries to {@spell identify} it, and it confers that item's property while on your person.",
	        	{
	        		"type":"entries",
	        		"name":"Curse",
	        		"entries":[
	        			"This item is cursed. The first time you take damage while wearing it, it begins to secrete a harmful acid for {@dice 1d4} rounds. As long as the acid is being secreted, you take {@dice 1d12} acid damage at the start of each of your turns."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Base items",
	        		"entries":[
	        			"This item variant can be applied to the following base items:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"{@item Breastplate|phb}",
	        					"{@item Chain Mail|phb}",
	        					"{@item Chain Shirt|phb}",
	        					"{@item Half Plate Armor|phb}",
	        					"{@item Hide Armor|phb}",
	        					"{@item Leather Armor|phb}",
	        					"{@item Padded Armor|phb}",
	        					"{@item Plate Armor|phb}",
	        					"{@item Ring Mail|phb}",
	        					"{@item Scale Mail|phb}",
	        					"{@item Splint Armor|phb}",
	        					"{@item Studded Leather Armor|phb}"
	        				]
	        			}
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Arcane Armor (WIP)",
	        "source": "EM5E",
	        "rarity": "legendary",
	        "tier": "major",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Arvoreen's Chain Mail",
	        "source": "EM5E",
	        "rarity": "very rare",
	        "tier": "major",
	        "bonusAc":"+2",
	        "baseItem":"chain mail|phb",
	        "ac":16,
	        "strength": "13",
	        "weight":55,
	        "type":"HA",
	        "stealth": true,
	        "armor":true,
	        "reqAttune":"by a spellcaster",
	        "reqAttuneTags":[
	        	{
					"spellcasting": true
	        	}
	        ],	
	        "entries": [
	        	"You have a +2 bonus to AC while wearing this armor.",
	        	"This armor has 10 charges. While wearing it, you can use an action to expend 1 or more of its charges to cast one of the following spells on yourself, using your spell save DC and spellcasting ability modifier: {@spell cure wounds} (1 charge per spell level, up to 4th), {@spell lesser restoration} (2 charges).",
	        	"Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets."
	        ]
	    },
	    {
	        "name": "Aslyferund's Armor (WIP)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Armor of Blackflame (WIP)",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Armor of Blending",
	        "source": "EM5E",
	        "rarity": "common",
	        "tier": "major",
	        "type":"GV",
	        "armor":true,
	        "reqAttune":false,
	        "entries": [
	        	"While donning this armor, you can speak the command word as a bonus action, magically concealing it and causing it to appear as a normal set of clothing. It remains concealed in this way until you doff the armor or use another bonus action to end the effect.",
	        	"If a creature uses its action to examine the armor, they can determine that it is magically concealed with a successful DC 15 Intelligence ({@skill Investigation}) check. If a creature discerns the magical concealment for what it is, the illusory clothing becomes faint to the creature.",
	        	{
	        		"type":"entries",
	        		"name":"Base items",
	        		"entries":[
	        			"This item variant can be applied to the following base items:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"{@item Breastplate|phb}",
	        					"{@item Chain Mail|phb}",
	        					"{@item Chain Shirt|phb}",
	        					"{@item Half Plate Armor|phb}",
	        					"{@item Hide Armor|phb}",
	        					"{@item Leather Armor|phb}",
	        					"{@item Padded Armor|phb}",
	        					"{@item Plate Armor|phb}",
	        					"{@item Ring Mail|phb}",
	        					"{@item Scale Mail|phb}",
	        					"{@item Splint Armor|phb}",
	        					"{@item Studded Leather Armor|phb}"
	        				]
	        			}
	        		]
	        	}
	        
	        ]
	    },
	    {
	        "name": "Blue Armor of the Crystalmist Mountains",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "bonusAc":"+2",
	        "type": "GV",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	"While wearing this armor, you have resistance to lightning damage and have a +1 bonus to AC.",
	        	{
	        		"type":"entries",
	        		"name":"Base items",
	        		"entries":[
	        			{
	        				"type":"list",
	        				"items":[
	        					"{@item Chain mail|phb}",
	        					"{@item Plate|phb}",
	        					"{@item Ring mail|phb}",
	        					"{@item Splint|phb}"
	        				]
	        			}
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Arvoreen's Chain Mail",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "Arvoreen's Chain Mail",
	        "source": "EM5E",
	        "rarity": "rare",
	        "tier": "major",
	        "armor":true,
	        "reqAttune":true,
	        "entries": [
	        	""
	        ]
	    }
	]
}