{
	"_meta":{
		"sources":[
			{
				"json":"EM5E",
				"abbreviation":"EM5E",
				"full":"Encyclopedia Magica for 5e",
				"authors":[
					"Zuishin"
				],
				"convertedBy":[
					"Zuishin"
				],
				"version":"1.0",
				"url":"https://github.com/ZuishinGit/ZuishinHomebrew/tree/master",
				"targetSchema":"1.0.0"
			}
		]
	},
	"table":[
		{
			"name":"Random Artifact Powers: Abjuration",
			"source":"EM5E",
			"caption": "Abjuring Effects of Artifacts",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cast {@spell banishment} (1/Week)"
				],
				[
					"2",
					"Cast {@spell antilife shell}, affecting one of the following creature types: aberrations, celestials, elementals, fey, fiends, or undead (1/Day)"
				],
				[
					"3",
					"Cast {@spell banishment} with range: touch (1/Day)"
				],
				[
					"4",
					"Instantly dismiss an elemental (1/Week)"
				],
				[
					"5",
					"Cast {@spell planar binding} (1/Week)"
				],
				[
					"6",
					"Cast {@spell dispel evil and good} (1/Day)"
				],
				[
					"7",
					"Cast {@spell dispel magic} (1/Day)"
				],
				[
					"8",
					"Cast {@spell holy aura} (1/Week)"
				],
				[
					"9",
					"Cast {@spell banishment}, sending a creature to a plane of the DM's choice (1/Week)"
				],
				[
					"10",
					"Cast {@spell imprisonment} (1/Month)"
				],
				[
					"11",
					"Cast {@spell knock} (3/Day)"
				],
				[
					"12",
					"Cast {@spell primordial ward} (1/Day)"
				],
				[
					"13",
					"Gain the following trait while holding the artifact: When you make a successful saving throw against a spell of 2nd level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"14",
					"Cast {@spell purify food and drink} (At will)"
				],
				[
					"15",
					"Cast {@spell remove curse} (3/Day)"
				],
				[
					"16",
					"Constantly repel all insects within 10 feet of the artifact"
				],
				[
					"17",
					"Cast {@spell magic circle} (1/Week)"
				],
				[
					"18",
					"Gain the following trait while holding the artifact: Once per day, when you make a successful saving throw against a spell of 7th level or lower, or such a spell attack misses you, you can choose another creature (including the spellcaster) that you can see within 30 feet of you. The spell targets the chosen creature instead of you. If the spell forced a saving throw, the chosen creature makes its own save. If the spell was an attack, the attack roll is rerolled against the chosen creature."
				],
				[
					"19",
					"Dispel illusions within a 60-foot radius (3/Day)"
				],
				[
					"20",
					"Have the {@spell resistance} spell continually in effect while the artifact is in hand"
				]
			]
		},
		{
			"name":"Random Artifact Powers: Cataclysm",
			"caption":"Cataclysmic Effects of Artifacts",
			"source":"EM5E",
			"colLabels":[
				"d20",
				"Effect"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					"Cause acid rain to fall (see the second round effect of the {@storm of vengeance} spell)"
				],
				[
					"2",
					"Create a permanent aura of {@hazard desecrated ground}, in which plants twist and wither, crops fail, and herds grow sickly"
				],
				[
					"3",
					"Blanket the area in a {@hazard blizzard} that lasts {@dice 1d6 + 12} hours"
				],
				[
					"4",
					"Create a storm of lightning that lasts 3 days, with lightning striking every 10 minutes per the {@spell call lightning} spell"
				],
				[
					"5",
					"Create an immobile {@spell cloudkill} spell for {@dice 1d6} hours"
				],
				[
					"6",
					"Form a ring of creeping doom in the area, taking 4 hours to reach the center. Until then, the area is infested with hazardous dark tendrils, per the {@spell arms of hadar} spell"
				],
				[
					"7",
					"Settle a fog of death over the area, which is fatal to creatures that stay in it for more than a day. The fog lasts {@dice 2d20} hours"
				],
				[
					"8",
					"Cause a permanent drought in the area"
				],
				[
					"9",
					"Cause an earthquake centered on the artifact, per the {@spell earthquake} spell"
				],
				[
					"10",
					"Call down a series of {@1d6} {@spell sunburst||sunbursts} within the area"
				],
				[
					"11",
					"Flood the area, per the {@spell tsunami} spell"
				],
				[
					"12",
					"Sweep an incendiary cloud through the entire area"
				],
				[
					"13",
					"Settle a plague of insects upon the area for {@dice 1d6} hours"
				],
				[
					"14",
					"Instantly create a permanent {@spell antimagic field} over the area"
				],
				[
					"15",
					"Call down a {@spell meteor swarm} that lasts for {@dice 1d12} hours (480 meteors per hour), randomly striking targets within the area"
				],
				[
					"16",
					"Create a permanent area which drains one point of a creature's Strength score for every 24 hours they spend in the area. A creature dies if this reduces its Strength to 0. The reduction lasts until the creature finishes a short or long rest outside of the area"
				],
				[
					"17",
					"Create a permanent wild magic zone (roll on the {@table Wild Magic Surge} table in the Player's Handbook whenever a spell is cast within the zone)"
				],
				[
					"18",
					"Transfer the whole area to a randomly chosen plane. The artifact is not transported"
				],
				[
					"19",
					"Strike the entire area with a {@spell storm of vengeance}"
				],
				[
					"20",
					"Create permanent wolf spirits to guard the area of effect, which are hostile to all creatures except beasts, plants, and constructs"
				]
			]
		},
		{
			"name":"Random Enhancements",
			"caption":"Magic items and their enhancements",
			"source":"EM5E",
			"colLabels":[
				"d100",
				"Enhancement Type"
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1-10",
					"{@item anything item|EM5E|anything}"
				],
				[
					"11-20",
					"{@item aquatic equipment|EM5E|aquatic}"
				],
				[
					"21-30",
					"{@item cloaked wizardry|EM5E|cloaked}"
				],
				[
					"31-40",
					"{@item lightweight equipment|EM5E|lightweight}"
				],
				[
					"41-50",
					"{@item miniature equipment|EM5E|miniature}"
				],
				[
					"51-60",
					"{@item polymorphed equipment|EM5E|polymorphed}"
				],
				[
					"61-70",
					"{@item psionic dampener|EM5E|dampening}"
				],
				[
					"71-80",
					"{@item quirk|EM5E|quirky}"
				]
			]
		}
	],
	"item": [
	    {
	        "name": "Anything Item",
	        "source": "EM5E",
	        "type": "GV",
	        "tier": "Major",
	        "rarity": "common",
	        "wondrous":"true",
	        "entries": [
	            "This magic item may take the form of any item of equal rarity. As an action, the user may command the item to transform into one of three randomly chosen items, which are decided upon this item's creation. If using the transformed item would normally destroy the item or consume it somehow, the Anything Item is also destroyed."
	        ]
	    },
	    {
	        "name": "Aquatic Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "major",
	        "wondrous": false,
	        "entries": [
	        	"These weapons and suits of armor only gain their bonus while underwater. This equipment may also have the added effect of removing the usual penalties suffered when engaging in underwater combat without a swimming speed."
	        ]
	    },
	    {
	        "name": "Cloaked Wizardry",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "major",
	        "wondrous": true,
	        "entries": [
	        	"The item is magical but appears as a nomagical object to spells and effects that would detect its magical aura."
	        ]
	    },
	    {
	        "name": "Lightweight Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These items are half of the weight of their normal counterpart. Weapons of this sort count as magical for the sake of overcoming resistances."
	        ]
	    },
	    {
	        "name": "Miniature Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"These are nonmagical items which have been magically shrunken down to a tiny size (that of a piece of jewellery). When the appropriate command word is spoken, they grow into their full-sized, nonmagical counterpart. When in miniature form, the weight is also reduced by an amount appropriate to the size reduction."
	        ]
	    },
	    {
	        "name": "Polymorphed Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":false,
	        "entries": [
	        	"Typically seen in the form of a brooch, a ring, or a gem, these are items which, when a command word is uttered, can be turned into a weapon, armor, or shield."
	        ]
	    },
	    {
	        "name": "Psionic Dampener",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "uncommon",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"Psionic dampeners are pieces of equipment or clothing that, when worn by a creature that uses psionics (i.e. {@creature mind flayer}), serves to reduce the spell save DC of psionically casted spells by 5. If a creature wearing a dampener decides to cast one of their psionic spells, they suffer a magical shock, taking 3 ({@dice 1d6}) points of lightning damage per the level of the spell that was cast. They can be removed as normal, thus these usually come in the form of manacles or other binding equipment."
	        ]
	    },
	    {
	        "name": "Weightless Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items have negligible weight, and can be carried without any encumberance, or can even magically lighten your burden."
	        ]
	    },
	    {
	        "name": "Quirky Equipment",
	        "source": "EM5E",
	        "type": "GV",
	        "rarity": "varies",
	        "tier": "minor",
	        "wondrous":false,
	        "weightMult": 0,
	        "entries": [
	        	"These items come with {@dice 1d4-1} randomly determined quirks, according to the following table (ignoring duplicate rolls):",
	        	{
	        		"type": "table",
	        		"colStyles": [
	        			"col-2 text-center",
	        			"col-10"
	        		],
	        		"colLabels": [
	        			"d100",
	        			"Quirk"
	        		],
	        		"rows": [
	        			[
	        				"1-03",
	        				"It takes {@dice 1d3} rounds to fetch the item from a container such as a backpack or sack."
	        			],
	        			[
	        				"4-07",
	        				"The item appears decrepit, but its function remains unimpaired."
	        			],
	        			[
	        				"08-11",
	        				"The item lies dormant for {@dice 1d4} days after becoming attuned, during which it can't be used and it confers none of its magical properties."
	        			],
	        			[
	        				"12-16",
	        				"The item audibly buzzes when it is used, alerting everyone (that is not {@condition deafened}) within 60 feet of its presence."
	        			],
	        			[
	        				"17-20",
	        				"The item is outlined in any combination of blue, green, or violet light (DM's choice), shedding dim light in a 10-foot radius."
	        			],
	        			[
	        				"21-24",
	        				"The item is immune to nonmagical damage."
	        			],
	        			[
	        				"25-29",
	        				"The item can't be used and it confers none of its magical properties while the user wears any kind of head gear or adornment."
	        			],
	        			[
	        				"30-32",
	        				"The item can't be used and it confers none of its magical properties while underground."
	        			],
	        			[
	        				"33",
	        				"The item can't be used and it confers none of its magical properties while above ground."
	        			],
	        			[
	        				"34-36",
	        				"The item can't be used and it confers none of its magical properties while it is night."
	        			],
	        			[
	        				"37-38",
	        				"The item can't be used and it confers none of its magical properties while it is day."
	        			],
	        			[
	        				"39-43",
	        				"The item can't be harmed by blows dealt by a creature with a Strength score of 19 or below."
	        			],
	        			[
	        				"44-48",
	        				"The item has {@dice 2d20} charges, which may or may not be recharged (DM's choice)."
	        			],
	        			[
	        				"49-51",
	        				"The item functions {@chance 30|70 percent of the time|Item's function}, failing otherwise."
	        			],
	        			[
	        				"52-55",
	        				"The item is magically buoyant and {@spell levitate|phb|levitates} upward at a rate of 5 feet per round unless held or tied down."
	        			],
	        			[
	        				"56-60",
	        				"The item is immune to lightning damage, and is nonconductive."
	        			],
	        			[
	        				"61-64",
	        				"The item can only be used twice per day. An attempt to use it a third time results in the item losing its magical properties for 48 hours."
	        			],
	        			[
	        				"65-69",
	        				"The item causes its owner to become extremely possessive of it. If 14 days pass while the item is still on your person, you gain the following flaw: \"Anyone who even mentions my item covets it, and I will never let them have it.\" The flaw can only be removed by a {@spell remove curse} or greater."
	        			],
	        			[
	        				"70-72",
	        				"The item is more powerful than normal, raising any associated DC by 1, and increasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"73-78",
	        				"The item is less powerful than normal, lowering any associated DC by 1, and decreasing its range of effectiveness by half of its current range."
	        			],
	        			[
	        				"79-83",
	        				"The item curses its owner with a -1 penalty to all saving throws until the item has a {@spell remove curse} cast upon it."
	        			],
	        			[
	        				"84-86",
	        				"The item can't be used and it confers none of its magical properties while submerged in water, unless it is designed to work underwater. In that case, it only functions underwater."
	        			],
	        			[
	        				"87-90",
	        				"The item belongs to an extraplanar creature or other powerful being who has imprinted a relevant symbol of theirs upon the item. After {@dice 1d4} weeks, the being becomes aware of the item's location and current user."
	        			],
	        			[
	        				"91-95",
	        				"The item can not be used more than once per minute."
	        			],
	        			[
	        				"96-98",
	        				"The item can only be destroyed as if it were an artifact."
	        			],
	        			[
	        				"99-00",
	        				"The item is sentient (roll on the tables in the {@book Creating Sentient Magic Items|DMG|7|creating sentient magic items} section of the Dungeon Master's Guide)."
	        			]
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "Abacus of Calculation",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "common",
	        "tier": "minor",
	        "wondrous":true,
	        "entries": [
	        	"This device is a simple wooden frame, about 8 by 10 inches. Several heavy wires are strung across the frame, parallel to one another. On each wire are 10 wooden balls. When mathematical formulas involving numbers (adding, subtracting, multiplying, dividing and simple operations) are spoken near the object, the balls shift about and the answer is spoken aloud by a disembodied voice."
	        ]
	    },
	    {
	        "name": "Accelerator",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "legendary",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"This rapid-fire weapon is comparable to a ballista, which is intended for use on a spelljamming craft. The magic of this device is derived from the helm, and is rendered nonmagical when either the helm of the spelljammer, or the accelerator itself are not installed. This turret-like device looks like a gigantic sextant. The main arm is a 4-foot-long, 6-inch-diameter hollow tube with a hand-sized cup at one end. The arm can be swiveled and elevated allowing for accurate firing. To fire the accelerator, an item can be placed in the cup-end of the arm, upon which it is magically seized and accelerated through the arm's length, and shot out the far end. It can be fired twice with one action. When fired this way, a creature makes a ranged weapon attack with a +10 to hit bonus, a range of 1,200/4,400 ft., dealing 22 ({@dice 4d10}) bludgeoning damage on a hit."
	        ]
	    },
	    {
	        "name": "Acorn of Wo Mai",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "artifact",
	        "tier": "major",
	        "wondrous":true,
	        "entries": [
	        	"The acorn of Wo Mai is a large lead vessel, dud gray in color. It is made in the likeness of a large acorn, 3 feet in height. Two golden bands inscribed with arcane characters encircle it from bottom to top, where they meet under a large seal of a dragon coiled around a sword. Although it looks heavy, the acorn weighs only 50 pounds. It occasionally makes faint thumping noises, and is warm to the touch.",
	        	"This lead vessel acts as the prison to a powerful and intelligent fiend, who would like nothing more than for someone to open the lid so it may be freed."
	        	{
	        		"type":"entries",
	        		"name":"Random Properties",
	        		"entries":[
	        			"The Acorn of Wo Mai has the following properties, determined by rolling on the tables in the \"Artifacts\" section in chapter 7 of the Dungeon Master's Guide:",
	        			{
	        				"type":"list",
	        				"items":[
	        					"1 {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial property}",
	        					"2 {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial properties}"
	        				]
	        			}
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Polymorph",
	        		"entries":[
	        			"The Acorn of Wo Mai can be used to cast the {@spell true polymorph} spell (object into creature only) once per day, regaining its use daily at dawn."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Sentience",
	        		"entries":[
	        			"The Acorn of Wo Mai acts as a sentient lawful evil magic item with an Intelligence of 20, a Wisdom of 15, and a Charisma of 24. It has hearing and {@sense darkvision} out to a range of 120 feet. It can communicate telepathically with the creature that is attuned to it, as long as that creature understands at least one language.",
	        			"If it is made evident to the fiend that its user has no intention of releasing it, the fiend attempts to take control of its owner (see \"Sentient Magic Items\" in chapter 7 of the Dungeon Master's Guide)."
	        		]
	        	},
	        	{
	        		"type":"entries",
	        		"name":"Personality",
	        		"entries":[
	        			"The Acorn of Wo Mai is a cunning fiend that uses its charm and wit to try and persuade others to free it, offering some of its immense power in exchange. It often gives good advice and answers harmless questions to build trust with its user."
	        		]
	        	}
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "",
	        "tier": "",
	        "wondrous":false,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "",
	        "tier": "",
	        "wondrous":false,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "",
	        "tier": "",
	        "wondrous":false,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "",
	        "tier": "",
	        "wondrous":false,
	        "entries": [
	        	""
	        ]
	    },
	    {
	        "name": "",
	        "source": "EM5E",
	        "type": "",
	        "rarity": "",
	        "tier": "",
	        "wondrous":false,
	        "entries": [
	        	""
	        ]
	    },
	    
	],
	/*"book":[
		{
			"name":"",
			"id":"",
			"source":"",
			"contents":[
				{
					"name":"",
					"headers":[
						""
					]
				}
			]
		}
	],
	"bookData":[
		{
			"id":"",
			"source":"",
			"data":[
				{
					
				}
			]
		}
	]*/
	/*"adventure":[
		{
			"name":"",
			"id":"",
			"source":"",
			"coverUrl":"",
			"published":"",
			"storyline":"",
			"level":{
				"start": 1,
				"end": 20
			},
			"contents":[
				{
					"name":"",
					"headers":[
						"",
						""
					]
				}
			]
		}
	],
	"adventureData":[
		{
			"id":"",
			"source":"",
			"data":[
				{

				}
			]
		}
	]*/
	/*"reward":[
		{
			"type":"boon",
			"name":"",
			"source":"",
			"entries":[
				""
			]
		}
	]*/
	/*"table":[
		{
			"name":"",
			"source":"",
			"colLabels":[
				"",
				""
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"",
					""
				]
			]
		},
		{
			"name":"",
			"caption":"",
			"source":"",
			"colLabels":[
				"d20",
				""
			],
			"colStyles":[
				"col-2 text-center",
				"col-10"
			],
			"rows":[
				[
					"1",
					""
				],
				[
					"2",
					""
				],
				[
					"3",
					""
				],
				[
					"4",
					""
				],
				[
					"5",
					""
				],
				[
					"6",
					""
				],
				[
					"7",
					""
				],
				[
					"8",
					""
				],
				[
					"9",
					""
				],
				[
					"10",
					""
				],
				[
					"11",
					""
				],
				[
					"12",
					""
				],
				[
					"13",
					""
				],
				[
					"14",
					""
				],
				[
					"15",
					""
				],
				[
					"16",
					""
				],
				[
					"17",
					""
				],
				[
					"18",
					""
				],
				[
					"19",
					""
				],
				[
					"20",
					""
				]
			]
		}
	]*/
}